let widthMain = document.documentElement.clientWidth,
    heightMain = document.documentElement.clientHeight,
    canvasWidth = 600,
    canvasHeight = 642;

const keys = ['Й', 'Ц', 'У', 'К', 'Е', 'Н', 'Г', 'Ш', 'Щ', 'З', 'Х', 'Ъ', 'Ы', 'В', 'А', 'П', 'Р', 'О', 'Л', 'Д', 'Ж', 'Э', 'Ф', 'Ы', 'ВВОД', 'Я', 'Ч', 'С', 'М', 'И', 'Т', 'Ь', 'Б', 'Ю', '⌫']

let words = ['АБЗАЦ', 'АВАНС', 'АГЕНТ', 'АДЕПТ', 'АДРЕС', 'АЗАРТ', 'АЗИАТ', 'АКТЕР', 'АКУЛА', 'АКЦИЯ', 'АЛКАШ', 'АЛЛЕЯ', 'АЛМАЗ', 'АМБАР', 'АМБРЕ', 'АМЕБА', 'АНГАР', 'АНГЕЛ', 'АНОНС', 'АРБУЗ', 'АРМИЯ', 'АРХИВ', 'АТАКА', 'АТЛАС', 'АТЛЕТ', 'АФИША', 'БАБКА', 'БАГАЖ', 'БАЗАР', 'БАНАН', 'БАНДА', 'БАНКА', 'БАРАН', 'БАРИН', 'БАРОН', 'БАСНЯ', 'БАТОН', 'БАШКА', 'БАШНЯ', 'БЕГУН', 'БЕДРО', 'БЕКОН', 'БЕЛКА', 'БЕЛОК', 'БЕЛЬЕ', 'БЕЛЯШ', 'БЕРЕГ', 'БЕТОН', 'БИДОН', 'БИЗОН', 'БИЛЕТ', 'БИРЖА', 'БИРКА', 'БИТВА', 'БЛАГО', 'БЛАЖЬ', 'БЛАНК', 'БЛЕСК', 'БЛОХА', 'БЛЮДО', 'БОБЕР', 'БОГАЧ', 'БОЙНЯ', 'БОКАЛ', 'БОМБА', 'БОРЕЦ', 'БОЧКА', 'БРЕМЯ', 'БРОВЬ', 'БРОНЯ', 'БРОШЬ', 'БРЮКИ', 'БРЮХО', 'БУБЕН', 'БУГАЙ', 'БУГОР', 'БУДКА', 'БУКВА', 'БУКЕТ', 'БУЛКА', 'БУРАН', 'БУФЕТ', 'БУХТА', 'БЫЧОК', 'ВАГОН', 'ВАЛЕТ', 'ВАЛУН', 'ВАЛЬС', 'ВАННА', 'ВАРАН', 'ВАРКА', 'ВАРЯГ', 'ВАТКА', 'ВАФЛЯ', 'ВАХТА', 'ВДОВА', 'ВЕДРО', 'ВЕЛЮР', 'ВЕНИК', 'ВЕНОК', 'ВЕПРЬ', 'ВЕСЛО', 'ВЕСНА', 'ВЕСТЬ', 'ВЕТВЬ', 'ВЕТЕР', 'ВЕТКА', 'ВЕЧЕР', 'ВЗВОД', 'ВЗДОР', 'ВЗДОХ', 'ВЗЛЕТ', 'ВЗЛОМ', 'ВЗМАХ', 'ВЗРЫВ', 'ВИДЕО', 'ВИЗИТ', 'ВИЛКА', 'ВИЛЛА', 'ВИРАЖ', 'ВИРУС', 'ВИСОК', 'ВИТОК', 'ВИХРЬ', 'ВИШНЯ', 'ВКЛАД', 'ВЛАГА', 'ВОБЛА', 'ВОДКА', 'ВОЖАК', 'ВОЖДЬ', 'ВОЙНА', 'ВОКАЛ', 'ВОЛНА', 'ВОЛОС', 'ВОЛХВ', 'ВОЛЬТ', 'ВОПЛЬ', 'ВОРОН', 'ВРАТА', 'ВРЕМЯ', 'ВЧЕРА', 'ВЪЕЗД', 'ВЫБОР', 'ВЫВОД', 'ВЫДОХ', 'ВЫДРА', 'ВЫЕЗД', 'ВЫЗОВ', 'ВЫКУП', 'ВЫЛЕТ', 'ВЫПАД', 'ВЫРЕЗ', 'ВЫХОД', 'ВЫШКА', 'ВЬЮГА', 'ГАЗОН', 'ГАЙКА', 'ГАЛКА', 'ГАЛОП', 'ГАМАК', 'ГАРАЖ', 'ГЕНИЙ', 'ГЕРОЙ', 'ГЕТТО', 'ГИДРА', 'ГИЕНА', 'ГЛАВА', 'ГЛАДЬ', 'ГЛИНА', 'ГЛИСТ', 'ГЛУШЬ', 'ГЛЫБА', 'ГНИЛЬ', 'ГОВОР', 'ГОГОТ', 'ГОЛОД', 'ГОЛОС', 'ГОЛЬФ', 'ГОНЕЦ', 'ГОНКА', 'ГОНОР', 'ГОРКА', 'ГОРЛО', 'ГОРОД', 'ГОРОХ', 'ГОСТЬ', 'ГРАММ', 'ГРАНЬ', 'ГРИВА', 'ГРИЛЬ', 'ГРИПП', 'ГРОЗА', 'ГРУДА', 'ГРУДЬ', 'ГРУНТ', 'ГРУША', 'ГРЫЖА', 'ГРЯЗЬ', 'ГУАШЬ', 'ГУБКА', 'ГУДОК', 'ГУЛЯШ', 'ГУСЛИ', 'ДАВКА', 'ДАМБА', 'ДАМКА', 'ДВЕРЬ', 'ДЕБРИ', 'ДЕБЮТ', 'ДЕВИЗ', 'ДЕКАН', 'ДЕКОР', 'ДЕМОН', 'ДЕСНА', 'ДЕТКА', 'ДЕФИС', 'ДЖИНН', 'ДЗЮДО', 'ДИВАН', 'ДИЕТА', 'ДЛАНЬ', 'ДЛИНА', 'ДНИЩЕ', 'ДОВОД', 'ДОЖДЬ', 'ДОЗОР', 'ДОНОР', 'ДОНОС', 'ДОСКА', 'ДОСУГ', 'ДОСЬЕ', 'ДОХОД', 'ДОЧКА', 'ДРАЖЕ', 'ДРАКА', 'ДРАМА', 'ДРЕВО', 'ДРЕЛЬ', 'ДРОБЬ', 'ДРОВА', 'ДРОЖЬ', 'ДРОЗД', 'ДРУИД', 'ДУДКА', 'ДУПЛО', 'ДУРАК', 'ДУШКА', 'ДУЭЛЬ', 'ДЫМКА', 'ДЫМОК', 'ДЫРКА', 'ДЯТЕЛ', 'ЕВРЕЙ', 'ЕГЕРЬ', 'ЕГОЗА', 'ЕЗДОК', 'ЕМЕЛЯ', 'ЕРЕСЬ', 'ЕРШИК', 'ЖАЖДА', 'ЖАКЕТ', 'ЖАТВА', 'ЖЕЛОБ', 'ЖЕЛЧЬ', 'ЖЕНИХ', 'ЖЕРЛО', 'ЖЕСТЬ', 'ЖЕТОН', 'ЖИВОТ', 'ЖИЗНЬ', 'ЖИЛЕТ', 'ЖИЛЕЦ', 'ЖИЛКА', 'ЖИЛЬЕ', 'ЖИРАФ', 'ЖИРОК', 'ЖИТИЕ', 'ЖИТЬЕ', 'ЖОКЕЙ', 'ЖРИЦА', 'ЖУЛИК', 'ЖУЧОК', 'ЗАБЕГ', 'ЗАБОР', 'ЗАВАЛ', 'ЗАВЕТ', 'ЗАВОД', 'ЗАВУЧ', 'ЗАГАР', 'ЗАГОН', 'ЗАГУЛ', 'ЗАДЕЛ', 'ЗАДОК', 'ЗАДОР', 'ЗАЕЗД', 'ЗАЖИМ', 'ЗАЗОР', 'ЗАЗЫВ', 'ЗАИКА', 'ЗАЙКА', 'ЗАКАЗ', 'ЗАКАТ', 'ЗАКОН', 'ЗАКУП', 'ЗАЛЕТ', 'ЗАЛИВ', 'ЗАЛОГ', 'ЗАЛОМ', 'ЗАМАХ', 'ЗАМЕР', 'ЗАМЕС', 'ЗАМОК', 'ЗАМША', 'ЗАНОС', 'ЗАПАД', 'ЗАПАЛ', 'ЗАПАС', 'ЗАПАХ', 'ЗАПОЙ', 'ЗАПОР', 'ЗАРЯД', 'ЗАСОВ', 'ЗАТЕЯ', 'ЗАТОН', 'ЗАТОР', 'ЗАХОД', 'ЗАЦЕП', 'ЗАЧЕС', 'ЗАЧЕТ', 'ЗВЕНО', 'ЗВЕРЬ', 'ЗЕБРА', 'ЗЕВОК', 'ЗЕЛЬЕ', 'ЗЕМЛЯ', 'ЗЕНИТ', 'ЗЕРНО', 'ЗЕФИР', 'ЗЛАТО', 'ЗЛОБА', 'ЗЛЮКА', 'ЗНАМЯ', 'ЗОМБИ', 'ЗРАЗА', 'ЗУБЕЦ', 'ИВРИТ', 'ИГРОК', 'ИДЕАЛ', 'ИЗВОЗ', 'ИЗГИБ', 'ИЗГОЙ', 'ИЗНОС', 'ИЗЪЯН', 'ИКОНА', 'ИКОТА', 'ИМИДЖ', 'ИНДУС', 'ИНДЮК', 'ИСКРА', 'ИСЛАМ', 'ИСПУГ', 'ИСТОК', 'ИСХОД', 'КАБАК', 'КАБАН', 'КАДЕТ', 'КАДЫК', 'КАЗАК', 'КАЗАН', 'КАЗАХ', 'КАЗНА', 'КАЗНЬ', 'КАЗУС', 'КАКАО', 'КАЛАЧ', 'КАМИН', 'КАМЫШ', 'КАНАЛ', 'КАНАТ', 'КАНОН', 'КАНОЭ', 'КАНУН', 'КАНЮК', 'КАПЛЯ', 'КАРТА', 'КАСКА', 'КАССА', 'КАСТА', 'КАТЕР', 'КАТОК', 'КАЮТА', 'КВАРЦ', 'КВОТА', 'КЕГЛЯ', 'КЕПКА', 'КЕФИР', 'КИВОК', 'КИОСК', 'КИРКА', 'КИСКА', 'КИСТА', 'КИСТЬ', 'КИШКА', 'КЛАДЬ', 'КЛАСС', 'КЛЕРК', 'КЛИПС', 'КЛИШЕ', 'КЛОУН', 'КЛУША', 'КЛЯЧА', 'КНИГА', 'КНЯЗЬ', 'КОАЛА', 'КОБРА', 'КОВЕР', 'КОВКА', 'КОЗЕЛ', 'КОЙКА', 'КОЙОТ', 'КОЛБА', 'КОЛЕЯ', 'КОЛОС', 'КОЛЬЕ', 'КОЛЬТ', 'КОМАР', 'КОМИК', 'КОМОД', 'КОМОК', 'КОНЕК', 'КОНЕЦ', 'КОНУС', 'КОНЮХ', 'КОПИЯ', 'КОПКА', 'КОПЬЕ', 'КОРКА', 'КОРОБ', 'КОСТЬ', 'КОСЯК', 'КОТЕЛ', 'КОТОК', 'КОФТА', 'КОЧАН', 'КОЧКА', 'КОШКА', 'КОЩЕЙ', 'КРАЖА', 'КРАСА', 'КРЕДО', 'КРЕСТ', 'КРОВЬ', 'КРОНА', 'КРОСС', 'КРОХА', 'КРУИЗ', 'КРУПА', 'КРЫЛО', 'КРЫСА', 'КРЫША', 'КУБИК', 'КУБОК', 'КУДРИ', 'КУЗЕН', 'КУЗНЯ', 'КУЗОВ', 'КУКЛА', 'КУЛАК', 'КУЛИЧ', 'КУЛОН', 'КУЛЬТ', 'КУМИР', 'КУМЫС', 'КУПЕЦ', 'КУПОЛ', 'КУПОН', 'КУРАЖ', 'КУСОК', 'КУТЕЖ', 'КУХНЯ', 'КУЧЕР', 'ЛАВАШ', 'ЛАВКА', 'ЛАВРА', 'ЛАДЬЯ', 'ЛАЗЕР', 'ЛАКЕЙ', 'ЛАМПА', 'ЛАПША', 'ЛАРЕК', 'ЛАРЕЦ', 'ЛАСКА', 'ЛАССО', 'ЛАТКА', 'ЛЕВША', 'ЛЕЖАК', 'ЛЕЙКА', 'ЛЕМУР', 'ЛЕНТА', 'ЛЕПЕТ', 'ЛЕПКА', 'ЛЕСКА', 'ЛЕСТЬ', 'ЛЕШИЙ', 'ЛИАНА', 'ЛИДЕР', 'ЛИЗУН', 'ЛИКЕР', 'ЛИЛИЯ', 'ЛИМИТ', 'ЛИМОН', 'ЛИМФА', 'ЛИНЗА', 'ЛИРИК', 'ЛИТВА', 'ЛИХАЧ', 'ЛИЦЕЙ', 'ЛИШАЙ', 'ЛОВЕЦ', 'ЛОВЛЯ', 'ЛОГИК', 'ЛОДКА', 'ЛОЖКА', 'ЛОКОН', 'ЛОМКА', 'ЛОПУХ', 'ЛОТОК', 'ЛОТОС', 'ЛЫЖНЯ', 'ЛЮТИК', 'ЛЮТНЯ', 'ЛЯМКА', 'МАГИЯ', 'МАГМА', 'МАДАМ', 'МАЖОР', 'МАЗНЯ', 'МАЗОК', 'МАЗУТ', 'МАЙКА', 'МАЙОР', 'МАКЕТ', 'МАЛЕЦ', 'МАЛЫШ', 'МАЛЯР', 'МАНГО', 'МАНЕЖ', 'МАНУЛ', 'МАРКА', 'МАРЛЯ', 'МАСКА', 'МАСЛО', 'МАССА', 'МАСТЬ', 'МАФИЯ', 'МАЧТА', 'МЕДИК', 'МЕСТО', 'МЕСТЬ', 'МЕСЯЦ', 'МЕТАН', 'МЕТИЛ', 'МЕТИС', 'МЕТКА', 'МЕТЛА', 'МЕТОД', 'МЕТРО', 'МЕЧТА', 'МЕШОК', 'МИНОР', 'МИНУС', 'МИРАЖ', 'МИСКА', 'МИТОЗ', 'МИШКА', 'МОЙКА', 'МОЛВА', 'МОЛОТ', 'МОНАХ', 'МОПЕД', 'МОРДА', 'МОРОЗ', 'МОРОК', 'МОРЯК', 'МОСОЛ', 'МОТИВ', 'МОТОК', 'МОТОР', 'МОЧКА', 'МОШКА', 'МУЖИК', 'МУЗЕЙ', 'МУЛАТ', 'МУЛЯЖ', 'МУМИЯ', 'МУФТА', 'МЫСЛЬ', 'МЫШКА', 'МЫШЦА', 'МЭРИЯ', 'МЯКИШ', 'МЯМЛЯ', 'МЯТЕЖ', 'НАБЕГ', 'НАВЕС', 'НАВОЗ', 'НАЕЗД', 'НАЛЕТ', 'НАЛОГ', 'НАМЕК', 'НАПЕВ', 'НАПОР', 'НАРОД', 'НАРЫВ', 'НАРЯД', 'НАУКА', 'НАХАЛ', 'НАЦИЯ', 'НАЧЕС', 'НЕДРА', 'НЕДУГ', 'НЕМЕЦ', 'НЕМКА', 'НЕФТЬ', 'НЕЧЕТ', 'НИТКА', 'НИЧЬЯ', 'НИЩАЯ', 'НОЖНЫ', 'НОМЕР', 'НОРМА', 'НОСОК', 'НУЖДА', 'НЫТИК', 'НЫТЬЕ', 'НЮАНС', 'ОАЗИС', 'ОБВАЛ', 'ОБГОН', 'ОБДУВ', 'ОБЗОР', 'ОБИДА', 'ОБКАТ', 'ОБЛЕТ', 'ОБЛИК', 'ОБЛОВ', 'ОБЛОМ', 'ОБМАН', 'ОБМЕН', 'ОБРАЗ', 'ОБРЕЗ', 'ОБРОК', 'ОБРУЧ', 'ОБРЫВ', 'ОБРЯД', 'ОБУВЬ', 'ОБУЗА', 'ОБХОД', 'ОБЧЕТ', 'ОБЪЕМ', 'ОБЫСК', 'ОВРАГ', 'ОГОНЬ', 'ОЗЕРО', 'ОЗНОБ', 'ОКЕАН', 'ОКЛАД', 'ОКЛИК', 'ОКРАС', 'ОКРИК', 'ОКРУГ', 'ОКУНЬ', 'ОЛЕНЬ', 'ОЛИМП', 'ОЛОВО', 'ОЛЬХА', 'ОМЛЕТ', 'ОПЕКА', 'ОПЕРА', 'ОПИСЬ', 'ОПЛОТ', 'ОПОРА', 'ОПРОС', 'ОРГАН', 'ОРДЕН', 'ОРДЕР', 'ОСАДА', 'ОСЕНЬ', 'ОСЕТР', 'ОСКАЛ', 'ОСЛИК', 'ОСОБА', 'ОСОБЬ', 'ОСТОВ', 'ОТБОЙ', 'ОТБОР', 'ОТВАЛ', 'ОТВАР', 'ОТВЕС', 'ОТВЕТ', 'ОТГУЛ', 'ОТДЫХ', 'ОТЕЛЬ', 'ОТЖИМ', 'ОТЗЫВ', 'ОТКАЗ', 'ОТКАТ', 'ОТКОЛ', 'ОТКОС', 'ОТКУП', 'ОТПОР', 'ОТРЫВ', 'ОТРЯД', 'ОТСЕВ', 'ОТХОД', 'ОТЧЕТ', 'ОТЧИМ', 'ОХВАТ', 'ОХОТА', 'ОЧЕРК', 'ОЩУПЬ', 'ПАДЕЖ', 'ПАКЕТ', 'ПАЛАС', 'ПАЛАЧ', 'ПАЛАШ', 'ПАЛЕЦ', 'ПАЛКА', 'ПАПКА', 'ПАРАД', 'ПАРИК', 'ПАРОМ', 'ПАСТА', 'ПАСТЬ', 'ПАСХА', 'ПАУЗА', 'ПАФОС', 'ПАЧКА', 'ПАШНЯ', 'ПЕВЕЦ', 'ПЕВУН', 'ПЕКЛО', 'ПЕНАЛ', 'ПЕНЕК', 'ПЕНИЕ', 'ПЕНКА', 'ПЕПЕЛ', 'ПЕРЕЦ', 'ПЕСЕЦ', 'ПЕСНЬ', 'ПЕСНЯ', 'ПЕСОК', 'ПЕТЛЯ', 'ПЕТУХ', 'ПЕЧКА', 'ПЕШКА', 'ПИЖОН', 'ПИЛКА', 'ПИЛОТ', 'ПИНОК', 'ПИНТА', 'ПИРАТ', 'ПИРОГ', 'ПИСЕЦ', 'ПИТОН', 'ПИЦЦА', 'ПЛАМЯ', 'ПЛАСТ', 'ПЛАТА', 'ПЛАТО', 'ПЛЕЕР', 'ПЛЕМЯ', 'ПЛЕСК', 'ПЛЕТЬ', 'ПЛЕЧО', 'ПЛЕШЬ', 'ПЛИТА', 'ПЛОТЬ', 'ПОБЕГ', 'ПОБОИ', 'ПОВАР', 'ПОВОД', 'ПОДОЛ', 'ПОЕЗД', 'ПОЖАР', 'ПОЗОР', 'ПОЗЫВ', 'ПОИСК', 'ПОКЕР', 'ПОКОЙ', 'ПОЛЕТ', 'ПОЛИВ', 'ПОЛИС', 'ПОЛКА', 'ПОЛЮС', 'ПОЛЯК', 'ПОМОЛ', 'ПОПСА', 'ПОРЕЗ', 'ПОРОК', 'ПОРОХ', 'ПОРЧА', 'ПОРЫВ', 'ПОСЕВ', 'ПОСОЛ', 'ПОСОХ', 'ПОТОК', 'ПОТОП', 'ПОХОД', 'ПОЧВА', 'ПОЧЕТ', 'ПОЧКА', 'ПОЧТА', 'ПОШИВ', 'ПОЭМА', 'ПРАВО', 'ПРЕСС', 'ПРИЕМ', 'ПРИНЦ', 'ПРИЮТ', 'ПРОБА', 'ПРОЕМ', 'ПРОЗА', 'ПРУСС', 'ПРЫТЬ', 'ПРЯДЬ', 'ПРЯЖА', 'ПРЯХА', 'ПСАРЬ', 'ПТАХА', 'ПТИЦА', 'ПУДРА', 'ПУЛЬС', 'ПУЛЬТ', 'ПУНКТ', 'ПУПОК', 'ПУРГА', 'ПУФИК', 'ПУЧОК', 'ПУШКА', 'ПУШОК', 'ПЧЕЛА', 'ПШЕНО', 'ПЫТКА', 'ПЫШКА', 'ПЬЕСА', 'ПЯТАК', 'ПЯТКА', 'ПЯТНО', 'РАДАР', 'РАДИО', 'РАЗУМ', 'РАЙОН', 'РАМКА', 'РАНЕЦ', 'РАУНД', 'РАЦИЯ', 'РВОТА', 'РЕБРО', 'РЕБУС', 'РЕВУН', 'РЕДИС', 'РЕЖИМ', 'РЕЗАК', 'РЕЗНЯ', 'РЕЗОН', 'РЕЙКА', 'РЕЛЬС', 'РЕНТА', 'РЕПЕР', 'РЕЧКА', 'РИНИТ', 'РИФМА', 'РОБОТ', 'РОЖОК', 'РОЖОН', 'РОЗГА', 'РОЗНЬ', 'РОКОТ', 'РОЛИК', 'РОМАН', 'РОПОТ', 'РОЯЛЬ', 'РТУТЬ', 'РУБЕЖ', 'РУБЕЦ', 'РУБИН', 'РУБКА', 'РУБЛЬ', 'РУЖЬЕ', 'РУКАВ', 'РУЛЕТ', 'РУЛОН', 'РУМЫН', 'РУПОР', 'РУСАК', 'РУСЛО', 'РУЧЕЙ', 'РУЧКА', 'РЫБАК', 'РЫБКА', 'РЫВОК', 'РЫЖИК', 'РЫНОК', 'РЫСАК', 'РЫЧАГ', 'РЭКЕТ', 'РЮМКА', 'САБЛЯ', 'САДИК', 'САЗАН', 'САЛАТ', 'САЛОН', 'САЛЮТ', 'САМБО', 'САМЕЦ', 'САМКА', 'САНКИ', 'САПЕР', 'САПОГ', 'САРАЙ', 'САТИР', 'САУНА', 'САХАР', 'СБРОД', 'СБРОС', 'СБРУЯ', 'СВАХА', 'СВЕЧА', 'СВИСТ', 'СВИТА', 'СВОРА', 'СВОЯК', 'СВЯЗЬ', 'СГЛАЗ', 'СЕАНС', 'СЕВЕР', 'СЕДЛО', 'СЕЗОН', 'СЕКТА', 'СЕМГА', 'СЕМЬЯ', 'СЕНАТ', 'СЕРИЯ', 'СЕТКА', 'СИЛАЧ', 'СИМКА', 'СИНУС', 'СИНЯК', 'СИРОП', 'СИТЦЕ', 'СИФОН', 'СКАЛА', 'СКВЕР', 'СКЕЙТ', 'СКЕПТ', 'СКЕТЧ', 'СКЛАД', 'СКЛЕП', 'СКЛОН', 'СКОБА', 'СКОТЧ', 'СКУКА', 'СКУЛА', 'СКУНС', 'СЛАВА', 'СЛЕЗА', 'СЛЕНГ', 'СЛИВА', 'СЛИЗЬ', 'СЛОВО', 'СЛУГА', 'СЛЮНА', 'СМЕРЧ', 'СМЕСЬ', 'СМЕТА', 'СМОЛА', 'СМУТА', 'СМЫСЛ', 'СНОХА', 'СОБОР', 'СОВЕТ', 'СОВОК', 'СОДОМ', 'СОЗЫВ', 'СОКОЛ', 'СОЛОД', 'СОПЛЯ', 'СОСЕД', 'СОСКА', 'СОСНА', 'СОСОК', 'СОСУД', 'СОТКА', 'СОТНЯ', 'СПАЗМ', 'СПИНА', 'СПИРТ', 'СПИЦА', 'СПЛАВ', 'СПОРА', 'СПОРТ', 'СПРЕЙ', 'СПРОС', 'СПРУТ', 'СПУСК', 'СРЕДА', 'ССОРА', 'СТАДО', 'СТАЛЬ', 'СТАРТ', 'СТВОЛ', 'СТВОР', 'СТЕГА', 'СТЕЗЯ', 'СТЕНА', 'СТЕНД', 'СТЕПЬ', 'СТИЛЬ', 'СТОЛБ', 'СТОЛП', 'СТОПА', 'СТОЯК', 'СТРАЖ', 'СТРАХ', 'СТРИЖ', 'СТРОЙ', 'СТРУЯ', 'СТУЖА', 'СУДАК', 'СУДНО', 'СУДЬЯ', 'СУЕТА', 'СУКНО', 'СУМКА', 'СУММА', 'СУПЕР', 'СУРОК', 'СУФЛЕ', 'СУЧОК', 'СУШКА', 'СФЕРА', 'СХЕМА', 'СЦЕНА', 'СЪЕЗД', 'СЫНОК', 'СЫРОК', 'СЫРЬЕ', 'СЫЩИК', 'СЮЖЕТ', 'ТАБАК', 'ТАБЛО', 'ТАБУН', 'ТАЗИК', 'ТАЙГА', 'ТАЙНА', 'ТАКСА', 'ТАКСИ', 'ТАЛИЯ', 'ТАЛОН', 'ТАНГО', 'ТАНЕЦ', 'ТАПКА', 'ТАРАН', 'ТАРИФ', 'ТАЧКА', 'ТЕАТР', 'ТЕЗИС', 'ТЕЗКА', 'ТЕКСТ', 'ТЕЛЕЦ', 'ТЕМБР', 'ТЕНЕК', 'ТЕПЛО', 'ТЕРЕМ', 'ТЕРКА', 'ТЕСАК', 'ТЕСКА', 'ТЕСТО', 'ТЕСТЬ', 'ТЕТКА', 'ТИПАЖ', 'ТИРАЖ', 'ТИРАН', 'ТИСКИ', 'ТИТУЛ', 'ТКАНЬ', 'ТОЛПА', 'ТОМАТ', 'ТОНИК', 'ТОННА', 'ТОНУС', 'ТОПАЗ', 'ТОПИК', 'ТОПКА', 'ТОПОР', 'ТОПОТ', 'ТОСКА', 'ТОТЕМ', 'ТОЧКА', 'ТРАВА', 'ТРАКТ', 'ТРАНС', 'ТРАТА', 'ТРАУР', 'ТРЕСК', 'ТРИКО', 'ТРОМБ', 'ТРОПА', 'ТРУБА', 'ТУМАК', 'ТУМАН', 'ТУМБА', 'ТУНЕЦ', 'ТУПИК', 'ТУРКА', 'ТУРНЕ', 'ТУФЛЯ', 'ТУЧКА', 'ТУШКА', 'ТЫКВА', 'ТЮБИК', 'ТЮФЯК', 'УГОДА', 'УГОЛЬ', 'УГОРЬ', 'УДАЧА', 'УДИЛО', 'УЗБЕК', 'УЗНИК', 'УКЛАД', 'УКЛОН', 'УКРОП', 'УКСУС', 'УЛИКА', 'УЛИЦА', 'УМНИК', 'УМОРА', 'УПРЕК', 'УПЫРЬ', 'УСПЕХ', 'УСТАВ', 'УСТОЙ', 'УСТУП', 'УСТЬЕ', 'УТЕРЯ', 'УТЕХА', 'УТИЛЬ', 'УЧЕБА', 'УЩЕРБ', 'ФАЗАН', 'ФАКЕЛ', 'ФАНАТ', 'ФАСАД', 'ФАСОН', 'ФАУНА', 'ФАЯНС', 'ФЕРЗЬ', 'ФЕРМА', 'ФИБРА', 'ФИЗИК', 'ФИКУС', 'ФИЛИН', 'ФИЛЬМ', 'ФИНАЛ', 'ФИНИК', 'ФИНИШ', 'ФИРМА', 'ФИТИН', 'ФИШКА', 'ФЛАНГ', 'ФЛИРТ', 'ФЛОРА', 'ФЛЯГА', 'ФОБИЯ', 'ФОКУС', 'ФОРМА', 'ФОРУМ', 'ФОТОН', 'ФРАЗА', 'ФРАНК', 'ФРОНТ', 'ФРУКТ', 'ФУЖЕР', 'ФУРИЯ', 'ФУРОР', 'ФЬОРД', 'ФЮРЕР', 'ХАКЕР', 'ХАЛАТ', 'ХАЛВА', 'ХАМКА', 'ХАНЖА', 'ХАРЧО', 'ХВАЛА', 'ХВОРЬ', 'ХВОСТ', 'ХИМИК', 'ХИМИЯ', 'ХИНДИ', 'ХИТИН', 'ХИТОН', 'ХЛЫСТ', 'ХМЕЛЬ', 'ХОББИ', 'ХОБОТ', 'ХОЛОД', 'ХОЛОП', 'ХОЛСТ', 'ХОМУТ', 'ХОМЯК', 'ХОРДА', 'ХОРЕК', 'ХОХМА', 'ХОХОЛ', 'ХОХОТ', 'ХРУСТ', 'ХУРМА', 'ХУТОР', 'ЦАПЛЯ', 'ЦАЦКА', 'ЦЕНТР', 'ЦИФРА', 'ЦЫГАН', 'ЧАЙКА', 'ЧАСТЬ', 'ЧАШКА', 'ЧЕЛКА', 'ЧЕРВЬ', 'ЧЕРЕД', 'ЧЕРЕП', 'ЧЕРНЬ', 'ЧЕРТА', 'ЧЕСТЬ', 'ЧЕХОЛ', 'ЧЕШУЯ', 'ЧИЖИК', 'ЧИСЛО', 'ЧТИВО', 'ЧУГУН', 'ЧУДАК', 'ЧУЖАК', 'ЧУЙКА', 'ЧУКЧА', 'ЧУЛАН', 'ЧУЛОК', 'ЧУТЬЕ', 'ШАЙБА', 'ШАЙКА', 'ШАКАЛ', 'ШАЛАШ', 'ШАЛУН', 'ШАМАН', 'ШАПКА', 'ШАРИК', 'ШАССИ', 'ШАТЕН', 'ШАТЕР', 'ШАХТА', 'ШАШКА', 'ШЕЙКА', 'ШЕПОТ', 'ШЕРИФ', 'ШИРМА', 'ШИТЬЕ', 'ШИФЕР', 'ШИШКА', 'ШКАЛА', 'ШКВАЛ', 'ШКОЛА', 'ШКУРА', 'ШЛАНГ', 'ШЛЕЙФ', 'ШЛЯПА', 'ШОРОХ', 'ШОССЕ', 'ШОФЕР', 'ШПАГА', 'ШПАЛА', 'ШПИЛЬ', 'ШПИОН', 'ШПОРА', 'ШПРИЦ', 'ШПРОТ', 'ШТАМП', 'ШТАНЫ', 'ШТИЛЬ', 'ШТОРА', 'ШТОРМ', 'ШТРАБ', 'ШТРАФ', 'ШТРИХ', 'ШТУКА', 'ШТУРМ', 'ШТЫРЬ', 'ШУЛЕР', 'ШУРИН', 'ШУРУП', 'ШУТКА', 'ЩЕНОК', 'ЩЕТКА', 'ЭКЛЕР', 'ЭКРАН', 'ЭЛИТА', 'ЭМАЛЬ', 'ЭПОХА', 'ЭСКИЗ', 'ЭТИКА', 'ЭТНОС', 'ЮНОША', 'ЮРИСТ', 'ЯБЕДА', 'ЯГОДА', 'ЯГУАР', 'ЯКОРЬ', 'ЯМЩИК', 'ЯРЛЫК', 'ЯСЕНЬ', 'ЯСТВО'],
    wordsAll = ['АБАКА', 'АББАТ', 'АБВЕР', 'АБЗАЦ', 'АБОРТ', 'АБРЕК', 'АБРИС', 'АБХАЗ', 'АБЦУГ', 'АБШИД', 'АВАНС', 'АВГИТ', 'АВГУР', 'АВЕНЮ', 'АВИЗО', 'АВОСЬ', 'АВРАЛ', 'АВТОЛ', 'АВТОР', 'АГАВА', 'АГАМА', 'АГАМИ', 'АГЕНТ', 'АГНАТ', 'АГНЕЦ', 'АГРАФ', 'АДЕПТ', 'АДРЕС', 'АДРЯС', 'АЖГОН', 'АЗАРТ', 'АЗИАТ', 'АЙВАН', 'АЙМАК', 'АЙРАН', 'АЙСОР', 'АКАЖУ', 'АКАНТ', 'АКРИЛ', 'АКСОН', 'АКТЕР', 'АКТИВ', 'АКУЛА', 'АКЦИЗ', 'АКЦИЯ', 'АЛАРМ', 'АЛЕУТ', 'АЛИБИ', 'АЛКАШ', 'АЛЛЕЯ', 'АЛЛЮР', 'АЛМАЗ', 'АЛТЕЙ', 'АЛТЫН', 'АЛЧБА', 'АЛЫЧА', 'АЛЬФА', 'АМБАР', 'АМБРА', 'АМБРЕ', 'АМВОН', 'АМЕБА', 'АМИНЬ', 'АМПЕР', 'АМПИР', 'АНГАР', 'АНГЕЛ', 'АНИОН', 'АНКЕР', 'АНОНС', 'АНТИК', 'АНТРЕ', 'АНЧАР', 'АНШЕФ', 'АОРТА', 'АПОРТ', 'АПРОШ', 'АРБУЗ', 'АРГОН', 'АРГУС', 'АРЕАЛ', 'АРЕКА', 'АРЕНА', 'АРЕСТ', 'АРИЕЦ', 'АРКАН', 'АРМИЯ', 'АРМЯК', 'АРХАР', 'АРХИВ', 'АРШИН', 'АСКЕР', 'АСКЕТ', 'АСПИД', 'АСТАТ', 'АСТМА', 'АСТРА', 'АСЦИТ', 'АТАКА', 'АТЛАС', 'АТЛЕТ', 'АТОЛЛ', 'АТТИК', 'АФЕРА', 'АФИША', 'АЦТЕК', 'АЭРОБ', 'АЭРОН', 'БАБКА', 'БАБЬЕ', 'БАГАЖ', 'БАГГИ', 'БАГЕТ', 'БАГОР', 'БАДАН', 'БАДЬЯ', 'БАЗАР', 'БАЗИС', 'БАЙГА', 'БАЙДА', 'БАЙКА', 'БАКАН', 'БАКЕН', 'БАКУН', 'БАЛДА', 'БАЛЕТ', 'БАЛКА', 'БАЛОК', 'БАЛЫК', 'БАНАН', 'БАНДА', 'БАНКА', 'БАРАК', 'БАРАН', 'БАРЕЖ', 'БАРЖА', 'БАРИЙ', 'БАРИН', 'БАРИТ', 'БАРИЧ', 'БАРКА', 'БАРМЫ', 'БАРОН', 'БАРЫШ', 'БАСКА', 'БАСМА', 'БАСНЬ', 'БАСНЯ', 'БАСОК', 'БАСОН', 'БАТАТ', 'БАТОГ', 'БАТОН', 'БАТУТ', 'БАТЫР', 'БАХТА', 'БАХЧА', 'БАЧОК', 'БАШКА', 'БАШНЯ', 'БЕГУН', 'БЕДРО', 'БЕЗИК', 'БЕЙКА', 'БЕКАР', 'БЕКАС', 'БЕКОН', 'БЕЛЕК', 'БЕЛЕЦ', 'БЕЛКА', 'БЕЛОК', 'БЕЛЬЕ', 'БЕЛЯК', 'БЕЛЯШ', 'БЕРДО', 'БЕРЕГ', 'БЕРЕТ', 'БЕТОН', 'БИВАК', 'БИДОН', 'БИЗОН', 'БИЛЕТ', 'БИЛЛЬ', 'БИНОМ', 'БИРЖА', 'БИРКА', 'БИРЮК', 'БИРЮЧ', 'БИСЕР', 'БИТВА', 'БИТОК', 'БИТУМ', 'БИТЬЕ', 'БИТЮГ', 'БЛАГО', 'БЛАЖЬ', 'БЛАНК', 'БЛАТО', 'БЛЕСК', 'БЛИЗЬ', 'БЛИНТ', 'БЛОХА', 'БЛУЗА', 'БЛЮДО', 'БЛЯХА', 'БОБЕР', 'БОБИК', 'БОБОК', 'БОГАЧ', 'БОДЯК', 'БОЖБА', 'БОЖОК', 'БОЙНЯ', 'БОКАЛ', 'БОЛИД', 'БОМБА', 'БОНЗА', 'БОНМО', 'БОННА', 'БОРДО', 'БОРЕЙ', 'БОРЕЦ', 'БОРОВ', 'БОРОК', 'БОРТЬ', 'БОСЯК', 'БОТВА', 'БОТИК', 'БОЧАГ', 'БОЧАР', 'БОЧКА', 'БОЧОК', 'БРАВО', 'БРАГА', 'БРАДА', 'БРАНЬ', 'БРАСС', 'БРЕМЯ', 'БРЕШЬ', 'БРИДЖ', 'БРИКА', 'БРИЛЬ', 'БРИТТ', 'БРОВЬ', 'БРОНХ', 'БРОНЯ', 'БРОШЬ', 'БРЫЖИ', 'БРЫЛА', 'БРЮКИ', 'БРЮХО', 'БУБЕН', 'БУБНА', 'БУБОН', 'БУГАЙ', 'БУГОР', 'БУДКА', 'БУДРА', 'БУДЯК', 'БУКАН', 'БУКВА', 'БУКЕТ', 'БУКЛЕ', 'БУКЛЯ', 'БУКСА', 'БУЛАТ', 'БУЛГА', 'БУЛКА', 'БУЛЛА', 'БУРАВ', 'БУРАК', 'БУРАН', 'БУРАТ', 'БУРДА', 'БУРКА', 'БУРСА', 'БУРУН', 'БУРЯТ', 'БУТАН', 'БУТОН', 'БУТСА', 'БУТУЗ', 'БУФЕР', 'БУФЕТ', 'БУХТА', 'БЫДЛО', 'БЫЛКА', 'БЫЛОЕ', 'БЫЛЬЕ', 'БЫТИЕ', 'БЫТЬЕ', 'БЫЧОК', 'БЮВАР', 'БЮВЕТ', 'БЮКСА', 'ВАБИК', 'ВАГОН', 'ВАЗОН', 'ВАКСА', 'ВАЛАХ', 'ВАЛЕЖ', 'ВАЛЕК', 'ВАЛЕР', 'ВАЛЕТ', 'ВАЛЕЦ', 'ВАЛИК', 'ВАЛКА', 'ВАЛОК', 'ВАЛУЙ', 'ВАЛУН', 'ВАЛУХ', 'ВАЛЬС', 'ВАННА', 'ВАНТА', 'ВАРАН', 'ВАРКА', 'ВАРОК', 'ВАРЯГ', 'ВАТИН', 'ВАТКА', 'ВАФЛЯ', 'ВАХТА', 'ВДОВА', 'ВЕДРО', 'ВЕДРО', 'ВЕДУН', 'ВЕЖДА', 'ВЕКША', 'ВЕЛЮР', 'ВЕНГР', 'ВЕНЕЦ', 'ВЕНИК', 'ВЕНОК', 'ВЕПРЬ', 'ВЕРБА', 'ВЕРВЬ', 'ВЕРЕД', 'ВЕРЕС', 'ВЕРЕЯ', 'ВЕРКИ', 'ВЕРФЬ', 'ВЕРША', 'ВЕСЛО', 'ВЕСНА', 'ВЕСОК', 'ВЕСТЬ', 'ВЕТВЬ', 'ВЕТЕР', 'ВЕТКА', 'ВЕТЛА', 'ВЕЧЕР', 'ВЕШКА', 'ВЕЩУН', 'ВЗБЕГ', 'ВЗВАР', 'ВЗВОД', 'ВЗДОР', 'ВЗДОХ', 'ВЗЛЕТ', 'ВЗЛОМ', 'ВЗМАХ', 'ВЗМЕТ', 'ВЗМЫВ', 'ВЗНОС', 'ВЗРЕЗ', 'ВЗРЫВ', 'ВЗРЫД', 'ВЗЫСК', 'ВИДЕО', 'ВИДИК', 'ВИДОК', 'ВИЗАЖ', 'ВИЗИР', 'ВИЗИТ', 'ВИЛКА', 'ВИЛЛА', 'ВИЛОК', 'ВИНЦО', 'ВИОЛА', 'ВИРАЖ', 'ВИРУС', 'ВИРША', 'ВИСКИ', 'ВИСОК', 'ВИТИЯ', 'ВИТОК', 'ВИТЬЕ', 'ВИХОР', 'ВИХРЬ', 'ВИШНЯ', 'ВКЛАД', 'ВЛАГА', 'ВЛАСЫ', 'ВНУКА', 'ВОБЛА', 'ВОГУЛ', 'ВОДКА', 'ВОЖАК', 'ВОЖДЬ', 'ВОЖЖА', 'ВОЗИК', 'ВОЗКА', 'ВОЗНЯ', 'ВОЗОК', 'ВОЙНА', 'ВОКАЛ', 'ВОЛАН', 'ВОЛГА', 'ВОЛНА', 'ВОЛОК', 'ВОЛОС', 'ВОЛХВ', 'ВОЛЬТ', 'ВОПЛЬ', 'ВОРОГ', 'ВОРОН', 'ВОРОТ', 'ВОРОХ', 'ВОРЬЕ', 'ВОТУМ', 'ВОТЯК', 'ВОШКА', 'ВОЯКА', 'ВПУСК', 'ВРАКИ', 'ВРАЛЬ', 'ВРАТА', 'ВРЕМЯ', 'ВРУША', 'ВСПЫХ', 'ВСХОД', 'ВТОРА', 'ВУАЛЬ', 'ВЧЕРА', 'ВЪЕЗД', 'ВЫБОЙ', 'ВЫБОР', 'ВЫВАЛ', 'ВЫВЕС', 'ВЫВИХ', 'ВЫВОД', 'ВЫВОЗ', 'ВЫГАР', 'ВЫГИБ', 'ВЫГОН', 'ВЫГУЛ', 'ВЫДЕЛ', 'ВЫДОХ', 'ВЫДРА', 'ВЫДУВ', 'ВЫЕЗД', 'ВЫЖИГ', 'ВЫЖИМ', 'ВЫЗОВ', 'ВЫКАТ', 'ВЫКОЛ', 'ВЫКОС', 'ВЫКУП', 'ВЫКУС', 'ВЫЛАЗ', 'ВЫЛЕТ', 'ВЫЛОВ', 'ВЫЛОМ', 'ВЫМАХ', 'ВЫМОР', 'ВЫНОС', 'ВЫПАД', 'ВЫПАЛ', 'ВЫПАР', 'ВЫПАС', 'ВЫПОР', 'ВЫПОТ', 'ВЫРЕЗ', 'ВЫРУБ', 'ВЫСЕВ', 'ВЫТЬЕ', 'ВЫХОД', 'ВЫЧЕТ', 'ВЫШКА', 'ВЬЮГА', 'ВЯЗКА', 'ВЯЗОК', 'ВЯТИЧ', 'ВЯТКА', 'ГАВОТ', 'ГАГАТ', 'ГАЗИК', 'ГАЗОК', 'ГАЗОН', 'ГАЙКА', 'ГАЛКА', 'ГАЛОП', 'ГАЛУН', 'ГАМАК', 'ГАММА', 'ГАНЕЦ', 'ГАНЗА', 'ГАНКА', 'ГАРАЖ', 'ГАРДА', 'ГАРЕМ', 'ГАРУС', 'ГАУСС', 'ГАШИШ', 'ГВАЛТ', 'ГЕЙША', 'ГЕЛИЙ', 'ГЕММА', 'ГЕНИЙ', 'ГЕРМА', 'ГЕРОЙ', 'ГЕТРА', 'ГЕТТО', 'ГЖЕЛЬ', 'ГИБКА', 'ГИДРА', 'ГИЕНА', 'ГИЛЯК', 'ГИНЕЯ', 'ГИПЮР', 'ГИРЛО', 'ГИТАН', 'ГИТОВ', 'ГИЧКА', 'ГЛАВА', 'ГЛАВК', 'ГЛАДЬ', 'ГЛИНА', 'ГЛИСТ', 'ГЛУБЬ', 'ГЛУШЬ', 'ГЛЫБА', 'ГЛЯСЕ', 'ГНЕЙС', 'ГНИДА', 'ГНИЛЬ', 'ГНОМА', 'ГНУСЬ', 'ГОБОЙ', 'ГОВОР', 'ГОГОТ', 'ГОДИК', 'ГОДОК', 'ГОЛЕЦ', 'ГОЛИК', 'ГОЛОД', 'ГОЛОС', 'ГОЛЫШ', 'ГОЛЬД', 'ГОЛЬЕ', 'ГОЛЬФ', 'ГОЛЯК', 'ГОМОН', 'ГОНЕЦ', 'ГОНКА', 'ГОНОР', 'ГОПАК', 'ГОРЕЦ', 'ГОРКА', 'ГОРЛО', 'ГОРНО', 'ГОРОД', 'ГОРОХ', 'ГОРЮН', 'ГОСТЬ', 'ГОФРЕ', 'ГРАВЕ', 'ГРАММ', 'ГРАНД', 'ГРАНЬ', 'ГРАФА', 'ГРЕБЬ', 'ГРЕЗА', 'ГРЕНА', 'ГРЕЧА', 'ГРИВА', 'ГРИДЬ', 'ГРИЛЬ', 'ГРИПП', 'ГРОЗА', 'ГРОЗД', 'ГРОСС', 'ГРУДА', 'ГРУДЬ', 'ГРУНТ', 'ГРУША', 'ГРЫЖА', 'ГРЯДА', 'ГРЯЗЬ', 'ГУАНО', 'ГУАШЬ', 'ГУБАН', 'ГУБКА', 'ГУГНЯ', 'ГУДОК', 'ГУЖИК', 'ГУЗКА', 'ГУЗНО', 'ГУЛЯШ', 'ГУММА', 'ГУММИ', 'ГУМНО', 'ГУМУС', 'ГУРАН', 'ГУРДА', 'ГУРИЯ', 'ГУСАК', 'ГУСАР', 'ГУСЕК', 'ГУСИТ', 'ГУСЛИ', 'ГУЦУЛ', 'ГЮРЗА', 'ДАВКА', 'ДАДАН', 'ДАМБА', 'ДАМКА', 'ДАЧКА', 'ДВЕРЬ', 'ДЕБЕТ', 'ДЕБИЛ', 'ДЕБИТ', 'ДЕБОШ', 'ДЕБРИ', 'ДЕБЮТ', 'ДЕВИЗ', 'ДЕВКА', 'ДЕВОН', 'ДЕДКА', 'ДЕДОК', 'ДЕЖКА', 'ДЕИЗМ', 'ДЕИСТ', 'ДЕКАН', 'ДЕКОР', 'ДЕЛЕЖ', 'ДЕЛЕЦ', 'ДЕМОН', 'ДЕМОС', 'ДЕНДИ', 'ДЕНЕК', 'ДЕРБИ', 'ДЕРЕН', 'ДЕРМА', 'ДЕРТЬ', 'ДЕСНА', 'ДЕСТЬ', 'ДЕТВА', 'ДЕТКА', 'ДЕФИС', 'ДЖИГА', 'ДЖИНН', 'ДЗЕТА', 'ДЗЮДО', 'ДИАНА', 'ДИВАН', 'ДИЕТА', 'ДИКАЯ', 'ДИНАР', 'ДИНГО', 'ДИЧОК', 'ДЛАНЬ', 'ДЛИНА', 'ДНИЩЕ', 'ДОБОР', 'ДОВОД', 'ДОГМА', 'ДОЖДЬ', 'ДОЖИМ', 'ДОЗОР', 'ДОЙКА', 'ДОЙНА', 'ДОЙРА', 'ДОКЕР', 'ДОМЕК', 'ДОМЕН', 'ДОМЕР', 'ДОМНА', 'ДОМРА', 'ДОНЕЦ', 'ДОНКА', 'ДОННА', 'ДОНОР', 'ДОНОС', 'ДОНЦЕ', 'ДОНЬЯ', 'ДОРКА', 'ДОСЕВ', 'ДОСКА', 'ДОСОЛ', 'ДОСУГ', 'ДОСЫЛ', 'ДОСЬЕ', 'ДОФИН', 'ДОХОД', 'ДОЧКА', 'ДОШКА', 'ДРАГА', 'ДРАЖЕ', 'ДРАКА', 'ДРАМА', 'ДРАНЬ', 'ДРЕВО', 'ДРЕЙФ', 'ДРЕЛЬ', 'ДРЕМА', 'ДРЕМА', 'ДРЕНА', 'ДРОБЬ', 'ДРОВА', 'ДРОГА', 'ДРОЖЬ', 'ДРОЗД', 'ДРОФА', 'ДРУЗА', 'ДРУИД', 'ДРЯНЬ', 'ДУБЕЦ', 'ДУБКА', 'ДУБЛЬ', 'ДУБОК', 'ДУБЬЕ', 'ДУВАЛ', 'ДУДАК', 'ДУДКА', 'ДУДУК', 'ДУЖКА', 'ДУКАТ', 'ДУМЕЦ', 'ДУМКА', 'ДУНЕЦ', 'ДУНИТ', 'ДУНСТ', 'ДУПЛО', 'ДУРАК', 'ДУРКА', 'ДУРРА', 'ДУРРО', 'ДУТАР', 'ДУТИК', 'ДУТЫШ', 'ДУТЬЕ', 'ДУХАН', 'ДУШКА', 'ДУШОК', 'ДУЭЛЬ', 'ДЩЕРЬ', 'ДЫЛДА', 'ДЫМКА', 'ДЫМОК', 'ДЫРКА', 'ДЫШЛО', 'ДЮБЕК', 'ДЮКЕР', 'ДЮШЕС', 'ДЯТЕЛ', 'ЕВНУХ', 'ЕВРЕЙ', 'ЕГЕРЬ', 'ЕГОЗА', 'ЕЖИХА', 'ЕЗДКА', 'ЕЗДОК', 'ЕЛИНА', 'ЕМЕЛЯ', 'ЕРЕСЬ', 'ЕРНИК', 'ЕРНИК', 'ЕРШИК', 'ЕСАУЛ', 'ЕХИДА', 'ЖАЖДА', 'ЖАКАН', 'ЖАКЕТ', 'ЖАКОБ', 'ЖАМКА', 'ЖАРКА', 'ЖАРОК', 'ЖАТВА', 'ЖАТКА', 'ЖЕВОК', 'ЖЕЛНА', 'ЖЕЛОБ', 'ЖЕЛТЬ', 'ЖЕЛЧЬ', 'ЖЕЛЧЬ', 'ЖЕНИХ', 'ЖЕНКА', 'ЖЕОДА', 'ЖЕРДЬ', 'ЖЕРЕХ', 'ЖЕРЛО', 'ЖЕСТЬ', 'ЖЕТОН', 'ЖИВЕЦ', 'ЖИВОТ', 'ЖИВЬЕ', 'ЖИЗНЬ', 'ЖИЛЕТ', 'ЖИЛЕЦ', 'ЖИЛКА', 'ЖИЛЬЕ', 'ЖИНКА', 'ЖИРАФ', 'ЖИРОК', 'ЖИТИЕ', 'ЖИТЬЕ', 'ЖМЕНЯ', 'ЖНИВА', 'ЖНИВО', 'ЖНИЦА', 'ЖОКЕЙ', 'ЖРИЦА', 'ЖУЛАН', 'ЖУЛИК', 'ЖУЛЬЕ', 'ЖУПАН', 'ЖУПЕЛ', 'ЖУРКА', 'ЖУЧКА', 'ЖУЧОК', 'ЗАБЕГ', 'ЗАБОЙ', 'ЗАБОР', 'ЗАВАЛ', 'ЗАВЕТ', 'ЗАВОД', 'ЗАВОЗ', 'ЗАВУЧ', 'ЗАГАР', 'ЗАГИБ', 'ЗАГОН', 'ЗАГУЛ', 'ЗАДЕЛ', 'ЗАДИК', 'ЗАДОК', 'ЗАДОР', 'ЗАЕДА', 'ЗАЕЗД', 'ЗАЖИМ', 'ЗАЖИН', 'ЗАЖОР', 'ЗАЗОР', 'ЗАЗЫВ', 'ЗАИКА', 'ЗАЙКА', 'ЗАКАЗ', 'ЗАКАЛ', 'ЗАКАТ', 'ЗАКОЛ', 'ЗАКОН', 'ЗАКУП', 'ЗАКУТ', 'ЗАЛЕТ', 'ЗАЛИВ', 'ЗАЛИЗ', 'ЗАЛОГ', 'ЗАЛОМ', 'ЗАМАХ', 'ЗАМЕР', 'ЗАМЕС', 'ЗАМЕТ', 'ЗАМОК', 'ЗАМОР', 'ЗАМША', 'ЗАНОС', 'ЗАПАД', 'ЗАПАЛ', 'ЗАПАС', 'ЗАПАХ', 'ЗАПЕВ', 'ЗАПОЙ', 'ЗАПОН', 'ЗАПОР', 'ЗАРЕЗ', 'ЗАРОД', 'ЗАРОК', 'ЗАРЯД', 'ЗАСЕВ', 'ЗАСОВ', 'ЗАСОЛ', 'ЗАСОС', 'ЗАСЫЛ', 'ЗАТЕК', 'ЗАТЕС', 'ЗАТЕЯ', 'ЗАТОК', 'ЗАТОН', 'ЗАТОР', 'ЗАУМЬ', 'ЗАХОД', 'ЗАЦЕП', 'ЗАЧЕС', 'ЗАЧЕТ', 'ЗАЧИН', 'ЗАЩИП', 'ЗВЕНО', 'ЗВЕНЬ', 'ЗВЕРЬ', 'ЗЕБРА', 'ЗЕВОК', 'ЗЕЛЬЕ', 'ЗЕЛЬЦ', 'ЗЕМЕЦ', 'ЗЕМЛЯ', 'ЗЕНИТ', 'ЗЕНКИ', 'ЗЕРНО', 'ЗЕРНЬ', 'ЗЕФИР', 'ЗИПУН', 'ЗЛАТО', 'ЗЛОБА', 'ЗЛЮКА', 'ЗНАМЯ', 'ЗНАТЬ', 'ЗОБИК', 'ЗОЛКА', 'ЗОМБИ', 'ЗРАЗА', 'ЗУБЕЦ', 'ЗУБИК', 'ЗУБОК', 'ЗУЛУС', 'ЗУРНА', 'ЗЫБКА', 'ЗЫБУН', 'ЗЯТЕК', 'ЗЯТИК', 'ИВАСИ', 'ИВИНА', 'ИВНЯК', 'ИВРИТ', 'ИГИЛЬ', 'ИГРЕК', 'ИГРОК', 'ИГРУН', 'ИДЕАЛ', 'ИДИОМ', 'ИДИОТ', 'ИЕРЕЙ', 'ИЖИЦА', 'ИЗБАЧ', 'ИЗВЕТ', 'ИЗВИВ', 'ИЗВОД', 'ИЗВОЗ', 'ИЗГИБ', 'ИЗГОЙ', 'ИЗЛЕТ', 'ИЗЛОМ', 'ИЗМОЛ', 'ИЗМОР', 'ИЗНОС', 'ИЗЪЯН', 'ИЗЫСК', 'ИЗЮБР', 'ИКОНА', 'ИКОТА', 'ИЛЬКА', 'ИЛЬМА', 'ИМИДЖ', 'ИНВАР', 'ИНГУШ', 'ИНДИЙ', 'ИНДУС', 'ИНДЮК', 'ИНЖИР', 'ИНОКА', 'ИНТИМ', 'ИНУЛА', 'ИОНИЯ', 'ИПРИТ', 'ИРБИС', 'ИРМОС', 'ИСКРА', 'ИСКУС', 'ИСЛАМ', 'ИСПОД', 'ИСПУГ', 'ИССОП', 'ИСТЕЦ', 'ИСТОД', 'ИСТОК', 'ИСХОД', 'ИУДЕЙ', 'ИШИАС', 'КАБАК', 'КАБАН', 'КАБИЛ', 'КАБУЛ', 'КАВУН', 'КАГАЛ', 'КАГАН', 'КАГАТ', 'КАГОР', 'КАДЕТ', 'КАДИЙ', 'КАДКА', 'КАДЫК', 'КАЗАК', 'КАЗАН', 'КАЗАХ', 'КАЗНА', 'КАЗНЬ', 'КАЗУС', 'КАЙЕН', 'КАЙЛА', 'КАЙЛО', 'КАЙМА', 'КАЙРА', 'КАКАО', 'КАЛАН', 'КАЛАЧ', 'КАЛИЙ', 'КАЛИФ', 'КАЛЛА', 'КАЛЫМ', 'КАМАС', 'КАМЕЯ', 'КАМИН', 'КАМКА', 'КАМСА', 'КАМУС', 'КАМЧА', 'КАМЫШ', 'КАНАЛ', 'КАНАТ', 'КАНВА', 'КАНОН', 'КАНОЭ', 'КАНУН', 'КАНЮК', 'КАПЕР', 'КАПЛЯ', 'КАПОК', 'КАПОР', 'КАПОТ', 'КАППА', 'КАРАТ', 'КАРГА', 'КАРДА', 'КАРЕЛ', 'КАРИБ', 'КАРСТ', 'КАРТА', 'КАСКА', 'КАССА', 'КАСТА', 'КАТАР', 'КАТЕР', 'КАТЕТ', 'КАТОД', 'КАТОК', 'КАТЫШ', 'КАЦАП', 'КАЧКА', 'КАШКА', 'КАШНЕ', 'КАШПО', 'КАЩЕЙ', 'КАЮТА', 'КВАНТ', 'КВАРК', 'КВАРЦ', 'КВОТА', 'КЕГЛЬ', 'КЕГЛЯ', 'КЕКУР', 'КЕЛЬТ', 'КЕЛЬЯ', 'КЕНАР', 'КЕНАФ', 'КЕПКА', 'КЕФИР', 'КИВЕР', 'КИВОК', 'КИЗИЛ', 'КИЗЯК', 'КИНЗА', 'КИНИК', 'КИОСК', 'КИПЕР', 'КИРЗА', 'КИРКА', 'КИРХА', 'КИСЕТ', 'КИСЕЯ', 'КИСКА', 'КИСТА', 'КИСТЬ', 'КИФОЗ', 'КИЧКА', 'КИШКА', 'КЛАДЬ', 'КЛАКА', 'КЛАСС', 'КЛЕКТ', 'КЛЕРК', 'КЛЕСТ', 'КЛЕТЬ', 'КЛИКА', 'КЛИКО', 'КЛИПС', 'КЛИШЕ', 'КЛОУН', 'КЛУНЯ', 'КЛУПП', 'КЛУША', 'КЛЮКА', 'КЛЯЧА', 'КНЕЛЬ', 'КНЕХТ', 'КНИГА', 'КНИКС', 'КНИЦА', 'КНЯЗЬ', 'КОАЛА', 'КОБЗА', 'КОБРА', 'КОБЫЗ', 'КОВАЧ', 'КОВЕР', 'КОВКА', 'КОЖАН', 'КОЖУХ', 'КОЖЬЕ', 'КОЗЕЛ', 'КОЗНЬ', 'КОЗОН', 'КОЙКА', 'КОЙНЕ', 'КОЙОТ', 'КОКЕТ', 'КОКОН', 'КОКОР', 'КОКОС', 'КОЛБА', 'КОЛЕР', 'КОЛЕТ', 'КОЛЕЯ', 'КОЛИК', 'КОЛИТ', 'КОЛКА', 'КОЛЛИ', 'КОЛОБ', 'КОЛОК', 'КОЛОН', 'КОЛОС', 'КОЛУН', 'КОЛЧА', 'КОЛЬЕ', 'КОЛЬТ', 'КОМАР', 'КОМИК', 'КОММИ', 'КОМОД', 'КОМОК', 'КОНЕК', 'КОНЕЦ', 'КОНИК', 'КОНКА', 'КОНУС', 'КОНЮХ', 'КОПАЛ', 'КОПАЧ', 'КОПЕР', 'КОПИР', 'КОПИЯ', 'КОПКА', 'КОПНА', 'КОПРА', 'КОПУН', 'КОПЫЛ', 'КОПЬЕ', 'КОРДА', 'КОРЕШ', 'КОРКА', 'КОРОБ', 'КОРЧА', 'КОРЧЬ', 'КОРЬЕ', 'КОРЯК', 'КОСАЧ', 'КОСАЯ', 'КОСЕЦ', 'КОСМЫ', 'КОСОК', 'КОСТЬ', 'КОСЬЕ', 'КОСЯК', 'КОТЕЛ', 'КОТИК', 'КОТОК', 'КОФЕЙ', 'КОФИЙ', 'КОФТА', 'КОЧАН', 'КОЧЕТ', 'КОЧКА', 'КОШКА', 'КОШМА', 'КОЩЕЙ', 'КРАГА', 'КРАЖА', 'КРАЛЯ', 'КРАПП', 'КРАСА', 'КРЕДО', 'КРЕОЛ', 'КРЕПЬ', 'КРЕСС', 'КРЕСТ', 'КРИЛЬ', 'КРИЦА', 'КРОАТ', 'КРОВЬ', 'КРОКИ', 'КРОЛЬ', 'КРОНА', 'КРОСС', 'КРОХА', 'КРОШЕ', 'КРУИЗ', 'КРУПА', 'КРУТЬ', 'КРУЧА', 'КРУЧЬ', 'КРЫЛО', 'КРЫСА', 'КРЫША', 'КУБИК', 'КУБЛО', 'КУБОК', 'КУДЛЫ', 'КУДРИ', 'КУЗЕН', 'КУЗНЯ', 'КУЗОВ', 'КУКАН', 'КУКИШ', 'КУКЛА', 'КУКША', 'КУЛАК', 'КУЛАН', 'КУЛЕК', 'КУЛЕШ', 'КУЛИК', 'КУЛИЧ', 'КУЛОН', 'КУЛЬТ', 'КУМАЧ', 'КУМЖА', 'КУМИР', 'КУМЫК', 'КУМЫС', 'КУНАК', 'КУПАЖ', 'КУПЕЦ', 'КУПЛЯ', 'КУПОЛ', 'КУПОН', 'КУРАЖ', 'КУРАЙ', 'КУРЕЦ', 'КУРИЯ', 'КУРКА', 'КУРОК', 'КУРЬЯ', 'КУСОК', 'КУТАС', 'КУТЕЖ', 'КУТОК', 'КУТУМ', 'КУТЬЯ', 'КУХВА', 'КУХНЯ', 'КУХТА', 'КУЧЕР', 'КУЧКА', 'КУШАК', 'КХМЕР', 'КЮВЕТ', 'КЮРИЙ', 'КЮРИН', 'ЛАБАЗ', 'ЛАБЕТ', 'ЛАВАШ', 'ЛАВКА', 'ЛАВРА', 'ЛАГУН', 'ЛАДАН', 'ЛАДЬЯ', 'ЛАЗЕР', 'ЛАЗЕЯ', 'ЛАЗКА', 'ЛАЗОК', 'ЛАЙБА', 'ЛАЙДА', 'ЛАЙКА', 'ЛАКЕЙ', 'ЛАМПА', 'ЛАМУТ', 'ЛАНДО', 'ЛАНДЫ', 'ЛАНКА', 'ЛАПКА', 'ЛАПТА', 'ЛАПША', 'ЛАРГО', 'ЛАРЕК', 'ЛАРЕЦ', 'ЛАСКА', 'ЛАССО', 'ЛАТКА', 'ЛАТУК', 'ЛАТЫШ', 'ЛАФЕТ', 'ЛАФИТ', 'ЛАЧКА', 'ЛБИНА', 'ЛБИЩЕ', 'ЛЕВАК', 'ЛЕВИТ', 'ЛЕВША', 'ЛЕГАТ', 'ЛЕГАШ', 'ЛЕДОК', 'ЛЕЖАК', 'ЛЕЖКА', 'ЛЕЙКА', 'ЛЕМЕШ', 'ЛЕММА', 'ЛЕМУР', 'ЛЕНОК', 'ЛЕНТА', 'ЛЕНТО', 'ЛЕНЦА', 'ЛЕПЕТ', 'ЛЕПКА', 'ЛЕПРА', 'ЛЕПТА', 'ЛЕРКА', 'ЛЕСКА', 'ЛЕСОК', 'ЛЕСТЬ', 'ЛЕТКА', 'ЛЕТОК', 'ЛЕТУН', 'ЛЕШАК', 'ЛЕШИЙ', 'ЛЕЩИК', 'ЛИАНА', 'ЛИВАН', 'ЛИВЕР', 'ЛИДЕР', 'ЛИЗИН', 'ЛИЗИС', 'ЛИЗОЛ', 'ЛИЗУН', 'ЛИКЕР', 'ЛИЛЕЯ', 'ЛИЛИЯ', 'ЛИМАН', 'ЛИМИТ', 'ЛИМОН', 'ЛИМФА', 'ЛИНЕК', 'ЛИНЗА', 'ЛИНИЯ', 'ЛИПЕЦ', 'ЛИПКА', 'ЛИПСИ', 'ЛИРИК', 'ЛИСКА', 'ЛИТВА', 'ЛИТЕР', 'ЛИТИЙ', 'ЛИТИЯ', 'ЛИТКА', 'ЛИТЬЕ', 'ЛИХАЧ', 'ЛИХВА', 'ЛИЦЕЙ', 'ЛИШАЙ', 'ЛИШЕК', 'ЛОБАН', 'ЛОББИ', 'ЛОБИК', 'ЛОБОК', 'ЛОВЕЦ', 'ЛОВЛЯ', 'ЛОГИК', 'ЛОДКА', 'ЛОЖКА', 'ЛОЖОК', 'ЛОКОН', 'ЛОМИК', 'ЛОМКА', 'ЛОНЖА', 'ЛОПУХ', 'ЛОТОК', 'ЛОТОС', 'ЛОХМЫ', 'ЛОЦИЯ', 'ЛОШАК', 'ЛУБОК', 'ЛУЖОК', 'ЛУЗГА', 'ЛУНИТ', 'ЛУНКА', 'ЛУПКА', 'ЛУЧИК', 'ЛУЧОК', 'ЛЫЖНЯ', 'ЛЫСУН', 'ЛЫТКА', 'ЛЫЧКО', 'ЛЬЯЛО', 'ЛЮБКА', 'ЛЮНЕТ', 'ЛЮПИН', 'ЛЮПУС', 'ЛЮРИК', 'ЛЮТИК', 'ЛЮТНЯ', 'ЛЮФФА', 'ЛЮЧОК', 'ЛЯГВА', 'ЛЯЖКА', 'ЛЯМКА', 'ЛЯПИС', 'ЛЯРВА', 'ЛЯССЕ', 'ЛЯШКА', 'МАГИК', 'МАГИЯ', 'МАГМА', 'МАДАМ', 'МАЕТА', 'МАЖОР', 'МАЗАР', 'МАЗЕР', 'МАЗИК', 'МАЗКА', 'МАЗЛО', 'МАЗНЯ', 'МАЗОК', 'МАЗУР', 'МАЗУТ', 'МАЙЕР', 'МАЙКА', 'МАЙНА', 'МАЙОР', 'МАКАО', 'МАКЕТ', 'МАКСА', 'МАКСИ', 'МАЛЕК', 'МАЛЕЦ', 'МАЛИК', 'МАЛКА', 'МАЛЫЙ', 'МАЛЫШ', 'МАЛЬЕ', 'МАЛЯР', 'МАМАН', 'МАМБА', 'МАМБО', 'МАМКА', 'МАНГО', 'МАНЕЖ', 'МАНЕР', 'МАНИЕ', 'МАНИЯ', 'МАНКА', 'МАНКО', 'МАННА', 'МАНОК', 'МАНСИ', 'МАНТО', 'МАНУЛ', 'МАОРИ', 'МАРАЛ', 'МАРАН', 'МАРГО', 'МАРКА', 'МАРЛЯ', 'МАСКА', 'МАСЛО', 'МАСОН', 'МАССА', 'МАСТЬ', 'МАТКА', 'МАТЮГ', 'МАТЮК', 'МАФИЯ', 'МАХАН', 'МАХРА', 'МАЧТА', 'МЕДИК', 'МЕДОК', 'МЕДЯК', 'МЕЗГА', 'МЕЗОН', 'МЕККА', 'МЕЛОК', 'МЕЛОС', 'МЕНКА', 'МЕРИН', 'МЕРКА', 'МЕССА', 'МЕСТО', 'МЕСТЬ', 'МЕСЬЕ', 'МЕСЯЦ', 'МЕТАН', 'МЕТИЛ', 'МЕТИС', 'МЕТКА', 'МЕТКА', 'МЕТЛА', 'МЕТОД', 'МЕТОЛ', 'МЕТРО', 'МЕЦЦО', 'МЕЧТА', 'МЕШОК', 'МИГАЧ', 'МИДИЯ', 'МИЗЕР', 'МИКСТ', 'МИЛКА', 'МИЛОК', 'МИЛЬТ', 'МИМИК', 'МИНЕР', 'МИНОР', 'МИНУС', 'МИОМА', 'МИРАБ', 'МИРАЖ', 'МИРЗА', 'МИРОК', 'МИРОН', 'МИРРА', 'МИРТА', 'МИСКА', 'МИТОЗ', 'МИТРА', 'МИШКА', 'МИШУК', 'МЛЕКО', 'МОГАР', 'МОГОЛ', 'МОДИЙ', 'МОДУС', 'МОЙВА', 'МОЙКА', 'МОЙРА', 'МОККО', 'МОКОЙ', 'МОКША', 'МОЛВА', 'МОЛВЬ', 'МОЛКА', 'МОЛОТ', 'МОЛОХ', 'МОЛЯН', 'МОЛЯР', 'МОНАХ', 'МОПЕД', 'МОРДА', 'МОРОЗ', 'МОРОК', 'МОРЦО', 'МОРЯК', 'МОСОЛ', 'МОСЬЕ', 'МОТЕТ', 'МОТИВ', 'МОТКА', 'МОТНЯ', 'МОТОК', 'МОТОР', 'МОТТО', 'МОХЕР', 'МОХНА', 'МОХНЫ', 'МОЧКА', 'МОШКА', 'МОШНА', 'МРАЗЬ', 'МУАРЕ', 'МУЖИК', 'МУЗГА', 'МУЗЕЙ', 'МУЛАТ', 'МУЛЛА', 'МУЛЯЖ', 'МУМИЕ', 'МУМИЯ', 'МУРАШ', 'МУРЗА', 'МУРИН', 'МУРЛО', 'МУРЬЯ', 'МУСОР', 'МУТОН', 'МУФТА', 'МУФТИ', 'МУЦИН', 'МУЧКА', 'МУШАР', 'МУШКА', 'МЫМРА', 'МЫСИК', 'МЫСЛЬ', 'МЫСОК', 'МЫТЬЕ', 'МЫЧКА', 'МЫШЕЙ', 'МЫШКА', 'МЫШЦА', 'МЭРИЯ', 'МЮЗЕТ', 'МЮРИД', 'МЯКИШ', 'МЯЛКА', 'МЯМЛЯ', 'МЯНДА', 'МЯСЦО', 'МЯТЕЖ', 'МЯТЬЕ', 'НАБАТ', 'НАБЕГ', 'НАБОБ', 'НАБОР', 'НАВАЛ', 'НАВАР', 'НАВЕС', 'НАВЕТ', 'НАВИС', 'НАВОЗ', 'НАВОЙ', 'НАВЫК', 'НАГАН', 'НАГАР', 'НАГИБ', 'НАГОН', 'НАГУЛ', 'НАДЕЛ', 'НАДИР', 'НАДОЙ', 'НАДУВ', 'НАЕЗД', 'НАЖИГ', 'НАЖИМ', 'НАЖИН', 'НАЗЕМ', 'НАКАЗ', 'НАКАЛ', 'НАКАТ', 'НАКОЛ', 'НАКРА', 'НАЛЕП', 'НАЛЕТ', 'НАЛИВ', 'НАЛИМ', 'НАЛОГ', 'НАЛОЙ', 'НАМАЗ', 'НАМЕК', 'НАМЕТ', 'НАМИН', 'НАМОЛ', 'НАМЫВ', 'НАНДУ', 'НАНКА', 'НАНОС', 'НАПЕВ', 'НАПОЙ', 'НАПОР', 'НАРЕЗ', 'НАРОД', 'НАРТА', 'НАРЫВ', 'НАРЯД', 'НАСАД', 'НАСОС', 'НАСЫП', 'НАТЕК', 'НАТЕС', 'НАТЯГ', 'НАУКА', 'НАФТА', 'НАХАЛ', 'НАХОД', 'НАЦИЯ', 'НАЧЕС', 'НАЧЕТ', 'НАЧИН', 'НАЯДА', 'НЕВЕР', 'НЕВОД', 'НЕГУС', 'НЕДРА', 'НЕДУГ', 'НЕМАЯ', 'НЕМЕЦ', 'НЕМКА', 'НЕНЕЦ', 'НЕНКА', 'НЕРКА', 'НЕРПА', 'НЕТЯГ', 'НЕФТЬ', 'НЕЧЕТ', 'НИВКА', 'НИЗКА', 'НИЗОК', 'НИКТО', 'НИЛОТ', 'НИМФА', 'НИТКА', 'НИЧТО', 'НИЧЬЯ', 'НИЩАЯ', 'НОВИК', 'НОВОЕ', 'НОЖИК', 'НОЖКА', 'НОЖНЫ', 'НОЙОН', 'НОЛИК', 'НОМАД', 'НОМЕР', 'НОНЕТ', 'НОРИЯ', 'НОРКА', 'НОРМА', 'НОРОВ', 'НОСАЧ', 'НОСИК', 'НОСКА', 'НОСОК', 'НОТИС', 'НОТКА', 'НОЧКА', 'НУДГА', 'НУЖДА', 'НУКЕР', 'НУЛИК', 'НУТРО', 'НЫРЕЦ', 'НЫРОК', 'НЫТИК', 'НЫТЬЕ', 'НЮАНС', 'ОАЗИС', 'ОБВАЛ', 'ОБВЕС', 'ОБВОД', 'ОБВОЗ', 'ОБГОН', 'ОБДЕЛ', 'ОБДИР', 'ОБДУВ', 'ОБЖИГ', 'ОБЖИМ', 'ОБЖИН', 'ОБЖОГ', 'ОБЗОР', 'ОБИДА', 'ОБКАТ', 'ОБКОМ', 'ОБКОС', 'ОБЛЕТ', 'ОБЛИК', 'ОБЛОВ', 'ОБЛОГ', 'ОБЛОМ', 'ОБМАН', 'ОБМЕН', 'ОБМЕР', 'ОБМЕТ', 'ОБМИН', 'ОБМОЛ', 'ОБМЫВ', 'ОБНОС', 'ОБОДЬ', 'ОБРАЗ', 'ОБРАТ', 'ОБРЕЗ', 'ОБРОК', 'ОБРУБ', 'ОБРУЧ', 'ОБРЫВ', 'ОБРЯД', 'ОБСЕВ', 'ОБУВЬ', 'ОБУЗА', 'ОБХОД', 'ОБЧЕТ', 'ОБЩЕЕ', 'ОБЪЕМ', 'ОБЫСК', 'ОВРАГ', 'ОВСЕЦ', 'ОВСЮГ', 'ОВЧАР', 'ОГОНЬ', 'ОГРЕХ', 'ОДЕЖА', 'ОДУРЬ', 'ОЖИНА', 'ОЗЕРО', 'ОЗИМЬ', 'ОЗНОБ', 'ОЙРОТ', 'ОКЕАН', 'ОКИСЬ', 'ОКИЯН', 'ОКЛАД', 'ОКЛИК', 'ОКОЕМ', 'ОКРАС', 'ОКРИК', 'ОКРОЛ', 'ОКРУГ', 'ОКТЕТ', 'ОКУНЬ', 'ОЛЕИН', 'ОЛЕНЬ', 'ОЛЕУМ', 'ОЛИВА', 'ОЛИМП', 'ОЛИФА', 'ОЛОВО', 'ОЛЬХА', 'ОМЕГА', 'ОМЕЛА', 'ОМЛЕТ', 'ОМУЛЬ', 'ОНАГР', 'ОНИКС', 'ОНУЧА', 'ОПАЛА', 'ОПАРА', 'ОПЕКА', 'ОПЕРА', 'ОПИСЬ', 'ОПИУМ', 'ОПЛОТ', 'ОПЛЫВ', 'ОПОЕК', 'ОПОКА', 'ОПОРА', 'ОПРОС', 'ОПТИК', 'ОРАВА', 'ОРАЛА', 'ОРАЛО', 'ОРАРЬ', 'ОРГАН', 'ОРГИЯ', 'ОРДЕН', 'ОРДЕР', 'ОРЕОЛ', 'ОРЖАД', 'ОРКАН', 'ОРЛАН', 'ОРЛЕЦ', 'ОРЛИК', 'ОРЛЯК', 'ОРШАД', 'ОСАДА', 'ОСЕНЬ', 'ОСЕТР', 'ОСИНА', 'ОСКАЛ', 'ОСЛИК', 'ОСЛЯК', 'ОСМАН', 'ОСМИЙ', 'ОСМОЛ', 'ОСМОС', 'ОСОБА', 'ОСОБЬ', 'ОСОЕД', 'ОСОКА', 'ОСТИТ', 'ОСТОВ', 'ОСТЮК', 'ОСТЯК', 'ОСЫПЬ', 'ОТАВА', 'ОТАРА', 'ОТБИВ', 'ОТБОЙ', 'ОТБОР', 'ОТВАЛ', 'ОТВАР', 'ОТВЕС', 'ОТВЕТ', 'ОТВОД', 'ОТВОЗ', 'ОТГИБ', 'ОТГОН', 'ОТГУЛ', 'ОТДЕЛ', 'ОТДУХ', 'ОТДЫХ', 'ОТЕЛЬ', 'ОТЖИГ', 'ОТЖИМ', 'ОТЗОЛ', 'ОТЗЫВ', 'ОТКАЗ', 'ОТКАТ', 'ОТКОЛ', 'ОТКОС', 'ОТКУП', 'ОТКУС', 'ОТЛЕТ', 'ОТЛИВ', 'ОТЛОВ', 'ОТЛОГ', 'ОТЛУП', 'ОТМАХ', 'ОТМОЛ', 'ОТНОС', 'ОТПАД', 'ОТПАЛ', 'ОТПОР', 'ОТРЕЗ', 'ОТРОГ', 'ОТРОК', 'ОТРУБ', 'ОТРЫВ', 'ОТРЯД', 'ОТСЕВ', 'ОТСЕК', 'ОТСОС', 'ОТТОК', 'ОТХОД', 'ОТЦЕП', 'ОТЧАЛ', 'ОТЧЕТ', 'ОТЧИМ', 'ОТЪЕМ', 'ОФЕНЯ', 'ОФОРТ', 'ОФСЕТ', 'ОХВАТ', 'ОХОТА', 'ОЧЕРК', 'ОШЕЕК', 'ОШКУЙ', 'ОЩУПЬ', 'ПАДЕЖ', 'ПАДЕЖ', 'ПАДОГ', 'ПАДУБ', 'ПАДУН', 'ПАЙВА', 'ПАЙЗА', 'ПАЙКА', 'ПАКЕТ', 'ПАКЛЯ', 'ПАЛАС', 'ПАЛАЧ', 'ПАЛАШ', 'ПАЛЕХ', 'ПАЛЕЦ', 'ПАЛЕЯ', 'ПАЛИЯ', 'ПАЛКА', 'ПАЛУБ', 'ПАМПА', 'ПАНАШ', 'ПАНЕР', 'ПАННА', 'ПАННО', 'ПАНТЫ', 'ПАНЬЕ', 'ПАНЬЯ', 'ПАПАХ', 'ПАПЕЖ', 'ПАПКА', 'ПАРАД', 'ПАРАФ', 'ПАРЕЗ', 'ПАРИК', 'ПАРИЯ', 'ПАРКА', 'ПАРНЯ', 'ПАРОК', 'ПАРОМ', 'ПАРТА', 'ПАРУН', 'ПАРУС', 'ПАРЧА', 'ПАРША', 'ПАСМА', 'ПАСМО', 'ПАСТА', 'ПАСТЬ', 'ПАСХА', 'ПАСЮК', 'ПАТАН', 'ПАТЕР', 'ПАТИО', 'ПАТЛЫ', 'ПАТУА', 'ПАУЗА', 'ПАФОС', 'ПАХВИ', 'ПАХВЫ', 'ПАХИТ', 'ПАХТА', 'ПАЦАН', 'ПАЧКА', 'ПАШНЯ', 'ПАЯЛО', 'ПЕВЕЦ', 'ПЕВУН', 'ПЕГАШ', 'ПЕКАН', 'ПЕКЛО', 'ПЕМЗА', 'ПЕНАЛ', 'ПЕНЕК', 'ПЕНИЕ', 'ПЕНИС', 'ПЕНКА', 'ПЕННИ', 'ПЕНЬЕ', 'ПЕНЬЕ', 'ПЕПЕЛ', 'ПЕПСИ', 'ПЕРГА', 'ПЕРЕД', 'ПЕРЕЦ', 'ПЕРКА', 'ПЕРЛО', 'ПЕРСИ', 'ПЕРСТ', 'ПЕРЬЕ', 'ПЕСЕЦ', 'ПЕСИК', 'ПЕСНЬ', 'ПЕСНЯ', 'ПЕСОК', 'ПЕТИТ', 'ПЕТЛЯ', 'ПЕТУХ', 'ПЕЧКА', 'ПЕШЕЦ', 'ПЕШКА', 'ПЕШНЯ', 'ПЕЩЕР', 'ПЕЩУР', 'ПИАЛА', 'ПИАНО', 'ПИВКО', 'ПИГУС', 'ПИЖМА', 'ПИЖОН', 'ПИИТА', 'ПИКАН', 'ПИКАП', 'ПИКЕР', 'ПИКЕТ', 'ПИКОН', 'ПИКША', 'ПИЛАВ', 'ПИЛАТ', 'ПИЛКА', 'ПИЛОН', 'ПИЛОТ', 'ПИНИЯ', 'ПИННА', 'ПИНОК', 'ПИНТА', 'ПИПКА', 'ПИРАТ', 'ПИРИТ', 'ПИРКЕ', 'ПИРОГ', 'ПИРОК', 'ПИРОП', 'ПИСЕЦ', 'ПИТОК', 'ПИТОН', 'ПИТЬЕ', 'ПИФОС', 'ПИХТА', 'ПИЦЦА', 'ПИЩИК', 'ПЛАВЬ', 'ПЛАМЯ', 'ПЛАСТ', 'ПЛАТА', 'ПЛАТО', 'ПЛАУН', 'ПЛАХА', 'ПЛЕБС', 'ПЛЕВА', 'ПЛЕЕР', 'ПЛЕМЯ', 'ПЛЕНА', 'ПЛЕСК', 'ПЛЕСО', 'ПЛЕТЬ', 'ПЛЕЧО', 'ПЛЕШЬ', 'ПЛИТА', 'ПЛИЦА', 'ПЛОТЬ', 'ПЛОХО', 'ПЛЮХА', 'ПНИЩЕ', 'ПОБЕГ', 'ПОБОИ', 'ПОВАЛ', 'ПОВАР', 'ПОВЕТ', 'ПОВОД', 'ПОВОЙ', 'ПОГИБ', 'ПОГОН', 'ПОДИЙ', 'ПОДОГ', 'ПОДОЙ', 'ПОДОЛ', 'ПОЕДЬ', 'ПОЕЗД', 'ПОЖАР', 'ПОЖНЯ', 'ПОЖОГ', 'ПОЗЕМ', 'ПОЗЕР', 'ПОЗОР', 'ПОЗЫВ', 'ПОЗЫК', 'ПОЙКА', 'ПОЙЛО', 'ПОЙМА', 'ПОИСК', 'ПОКАЗ', 'ПОКАТ', 'ПОКЕР', 'ПОКОЙ', 'ПОКОС', 'ПОКУС', 'ПОЛБА', 'ПОЛЕТ', 'ПОЛИВ', 'ПОЛИП', 'ПОЛИС', 'ПОЛКА', 'ПОЛОГ', 'ПОЛОЗ', 'ПОЛОЙ', 'ПОЛОК', 'ПОЛОМ', 'ПОЛОН', 'ПОЛЮС', 'ПОЛЯК', 'ПОЛЯШ', 'ПОМЕТ', 'ПОМИН', 'ПОМОИ', 'ПОМОЛ', 'ПОМОР', 'ПОМПА', 'ПОНОС', 'ПОНЧО', 'ПОНЮХ', 'ПОПАС', 'ПОПИК', 'ПОПКА', 'ПОПСА', 'ПОРЕЗ', 'ПОРЕЙ', 'ПОРКА', 'ПОРОГ', 'ПОРОК', 'ПОРОХ', 'ПОРТО', 'ПОРУБ', 'ПОРЧА', 'ПОРЫВ', 'ПОСАД', 'ПОСЕВ', 'ПОСОЛ', 'ПОСОХ', 'ПОСУЛ', 'ПОСЫЛ', 'ПОТАШ', 'ПОТЕК', 'ПОТИР', 'ПОТОК', 'ПОТОП', 'ПОТЯГ', 'ПОХОД', 'ПОЧВА', 'ПОЧЕТ', 'ПОЧИН', 'ПОЧКА', 'ПОЧТА', 'ПОШИБ', 'ПОШИВ', 'ПОЭМА', 'ПРАВО', 'ПРАЩА', 'ПРЕЛЬ', 'ПРЕСС', 'ПРИЕМ', 'ПРИМА', 'ПРИНЦ', 'ПРИОР', 'ПРИЧТ', 'ПРИЮТ', 'ПРОБА', 'ПРОЕМ', 'ПРОЗА', 'ПРОПС', 'ПРОСО', 'ПРОУХ', 'ПРОФИ', 'ПРУСС', 'ПРЫСК', 'ПРЫТЬ', 'ПРЯДЬ', 'ПРЯЖА', 'ПРЯХА', 'ПСАРЬ', 'ПСИНА', 'ПСИЦА', 'ПСИШЕ', 'ПТАХА', 'ПТИЦА', 'ПУАНТ', 'ПУГАЧ', 'ПУДИК', 'ПУДРА', 'ПУЗАН', 'ПУКЛЯ', 'ПУЛЬС', 'ПУЛЬТ', 'ПУНЕЦ', 'ПУНКТ', 'ПУПОК', 'ПУРГА', 'ПУРИН', 'ПУРКА', 'ПУСТО', 'ПУТЕЦ', 'ПУТИК', 'ПУФИК', 'ПУЧКА', 'ПУЧОК', 'ПУШКА', 'ПУШОК', 'ПЧЕЛА', 'ПШЕНО', 'ПЫЖИК', 'ПЫРЕЙ', 'ПЫТКА', 'ПЫШКА', 'ПЬЕЗА', 'ПЬЕСА', 'ПЯЛКА', 'ПЯСТЬ', 'ПЯТАК', 'ПЯТКА', 'ПЯТНО', 'ПЯТОК', 'РАДАР', 'РАДЖА', 'РАДИЙ', 'РАДИО', 'РАДОН', 'РАЗИК', 'РАЗОК', 'РАЗОР', 'РАЗУМ', 'РАИНА', 'РАЙОН', 'РАКИЯ', 'РАКША', 'РАМКА', 'РАМПА', 'РАНЕТ', 'РАНЕЦ', 'РАНКА', 'РАСТР', 'РАТАЙ', 'РАТИН', 'РАУНД', 'РАФИЯ', 'РАХИТ', 'РАЦЕЯ', 'РАЦИЯ', 'РАЧОК', 'РВАНЬ', 'РВОТА', 'РДЕСТ', 'РЕБАБ', 'РЕБРО', 'РЕБУС', 'РЕВУН', 'РЕГБИ', 'РЕДАН', 'РЕДИС', 'РЕДУТ', 'РЕЖИМ', 'РЕЗАК', 'РЕЗЕЦ', 'РЕЗКА', 'РЕЗНЯ', 'РЕЗОН', 'РЕЙКА', 'РЕЛЬС', 'РЕМЕЗ', 'РЕМИЗ', 'РЕНЕТ', 'РЕНИЙ', 'РЕНТА', 'РЕПЕЙ', 'РЕПЕР', 'РЕПКА', 'РЕПЬЕ', 'РЕЧКА', 'РЕШКА', 'РЖАВЬ', 'РЖИЦА', 'РЖИЩЕ', 'РИЗКИ', 'РИКША', 'РИНИТ', 'РИПУС', 'РИСКА', 'РИТОР', 'РИФМА', 'РИШТА', 'РОБОТ', 'РОВИК', 'РОВНЯ', 'РОГАЧ', 'РОГОЗ', 'РОДИЙ', 'РОДИЧ', 'РОДНЯ', 'РОЖАК', 'РОЖОК', 'РОЖОН', 'РОЗАН', 'РОЗГА', 'РОЗНЬ', 'РОЙБА', 'РОЙКА', 'РОКЕР', 'РОКОТ', 'РОЛИК', 'РОМАН', 'РОМЕЦ', 'РОМОК', 'РОМША', 'РОНДО', 'РОНЖА', 'РОПАК', 'РОПОТ', 'РОСТР', 'РОТИК', 'РОТОК', 'РОТОР', 'РОХЛЯ', 'РОЯЛЬ', 'РТИЩЕ', 'РТУТЬ', 'РУБЕЖ', 'РУБЕЦ', 'РУБИН', 'РУБКА', 'РУБЛЬ', 'РУГНЯ', 'РУДЯК', 'РУЖЬЕ', 'РУИНА', 'РУКАВ', 'РУЛЕТ', 'РУЛОН', 'РУМБА', 'РУМЫН', 'РУПИЯ', 'РУПОР', 'РУСАК', 'РУСИН', 'РУСЛО', 'РУТИЛ', 'РУЧЕЙ', 'РУЧКА', 'РЫБАК', 'РЫБЕЦ', 'РЫБКА', 'РЫВОК', 'РЫЖАК', 'РЫЖИК', 'РЫНДА', 'РЫНОК', 'РЫСАК', 'РЫСЦА', 'РЫТЬЕ', 'РЫЧАГ', 'РЭКЕТ', 'РЮМКА', 'РЮШКА', 'РЯБЕЦ', 'РЯБИК', 'РЯБОК', 'РЯДНО', 'РЯДОК', 'РЯСКА', 'РЯСНА', 'СААМИ', 'САБАН', 'САБЕИ', 'САБЕЙ', 'САБЗА', 'САБЛЯ', 'САБУР', 'САВАН', 'САГИБ', 'САДИК', 'САДНО', 'САДОК', 'САЗАН', 'САЙГА', 'САЙДА', 'САЙКА', 'САЙРА', 'САКВА', 'САКЛЯ', 'САЛАТ', 'САЛМА', 'САЛОЛ', 'САЛОН', 'САЛОП', 'САЛЮТ', 'САМАН', 'САМБА', 'САМБО', 'САМЕЦ', 'САМКА', 'САМУМ', 'САНКИ', 'САПЕР', 'САПКА', 'САПОГ', 'САПУН', 'САРАЙ', 'САРЖА', 'САРЫЧ', 'САТИН', 'САТИР', 'САУНА', 'САХАР', 'САЧОК', 'СБОРА', 'СБРОД', 'СБРОС', 'СБРУЯ', 'СВАРА', 'СВАХА', 'СВЕЧА', 'СВИЛЬ', 'СВИСТ', 'СВИТА', 'СВОРА', 'СВОЯК', 'СВЯЗА', 'СВЯЗЬ', 'СГЛАЗ', 'СДАЧА', 'СДВИГ', 'СДОБА', 'СЕАНС', 'СЕВБА', 'СЕВЕР', 'СЕВОК', 'СЕДЛО', 'СЕДОК', 'СЕЕВО', 'СЕЗАМ', 'СЕЗОН', 'СЕЙИД', 'СЕЙША', 'СЕКАЧ', 'СЕКТА', 'СЕЛЕН', 'СЕЛИН', 'СЕМГА', 'СЕМИТ', 'СЕМЬЯ', 'СЕНАТ', 'СЕНЦО', 'СЕНЦЫ', 'СЕПИЯ', 'СЕРИЯ', 'СЕРКА', 'СЕРКО', 'СЕРНА', 'СЕРСО', 'СЕРУМ', 'СЕТКА', 'СЕУНЧ', 'СЕЧКА', 'СИАЛЬ', 'СИВАЯ', 'СИВЕР', 'СИВКА', 'СИВКО', 'СИВУЧ', 'СИГМА', 'СИДОР', 'СИЕНА', 'СИЖОК', 'СИЗЯК', 'СИЛАЧ', 'СИЛКА', 'СИЛОК', 'СИЛОН', 'СИЛОС', 'СИЛУР', 'СИЛЬФ', 'СИМКА', 'СИНАП', 'СИНЕЦ', 'СИНОД', 'СИНУС', 'СИНЯК', 'СИНЯЯ', 'СИПАЙ', 'СИРЕН', 'СИРИН', 'СИРОП', 'СИСТР', 'СИТАР', 'СИТЕЦ', 'СИТРО', 'СИТЦЕ', 'СИФОН', 'СКАЛА', 'СКАЛО', 'СКАНЬ', 'СКАРБ', 'СКАРН', 'СКАУТ', 'СКАЧЬ', 'СКВЕР', 'СКЕЙТ', 'СКЕНА', 'СКЕПТ', 'СКЕТЧ', 'СКИРД', 'СКЛАД', 'СКЛЕП', 'СКЛИЗ', 'СКЛОН', 'СКОБА', 'СКОПА', 'СКОРА', 'СКОРМ', 'СКОТЧ', 'СКРАП', 'СКРЕП', 'СКРИП', 'СКУДИ', 'СКУДО', 'СКУКА', 'СКУЛА', 'СКУНС', 'СЛАВА', 'СЛАЙД', 'СЛАНЬ', 'СЛЕГА', 'СЛЕЗА', 'СЛЕНГ', 'СЛИВА', 'СЛИЗЬ', 'СЛОВО', 'СЛУГА', 'СЛУДА', 'СЛУКА', 'СЛЮДА', 'СЛЮНА', 'СМАЗЬ', 'СМЕНА', 'СМЕРД', 'СМЕРЧ', 'СМЕСЬ', 'СМЕТА', 'СМОЛА', 'СМОЛЬ', 'СМОТР', 'СМРАД', 'СМУТА', 'СМУТЬ', 'СМЫСЛ', 'СНЕДЬ', 'СНОХА', 'СНЫТЬ', 'СОБОР', 'СОВЕТ', 'СОВИК', 'СОВКА', 'СОВОК', 'СОГДЫ', 'СОГРА', 'СОДОМ', 'СОЗЫВ', 'СОЙКА', 'СОЙМА', 'СОЙОТ', 'СОКОЛ', 'СОЛЕЯ', 'СОЛКА', 'СОЛОД', 'СОЛЯР', 'СОМИК', 'СОМЬЕ', 'СОНЕТ', 'СОПКА', 'СОПЛО', 'СОПЛЯ', 'СОПУН', 'СОРГО', 'СОРИТ', 'СОРОК', 'СОРОМ', 'СОРУС', 'СОСЕД', 'СОСЕЦ', 'СОСКА', 'СОСНА', 'СОСОК', 'СОСУД', 'СОСУН', 'СОТАЯ', 'СОТКА', 'СОТНЯ', 'СОФИТ', 'СОХАЧ', 'СОШКА', 'СПАЗМ', 'СПЕСЬ', 'СПИНА', 'СПИРТ', 'СПИЦА', 'СПЛАВ', 'СПЛИН', 'СПОРА', 'СПОРТ', 'СПРЕЙ', 'СПРОС', 'СПРУТ', 'СПУРТ', 'СПУСК', 'СРЕДА', 'ССОРА', 'ССУДА', 'СТАДО', 'СТАЛЬ', 'СТАНС', 'СТАРТ', 'СТАРЬ', 'СТАТЬ', 'СТВОЛ', 'СТВОР', 'СТЕГА', 'СТЕЗЯ', 'СТЕКА', 'СТЕЛА', 'СТЕНА', 'СТЕНД', 'СТЕНЬ', 'СТЕПС', 'СТЕПЬ', 'СТИЛО', 'СТИЛЬ', 'СТОИК', 'СТОЛБ', 'СТОЛП', 'СТОПА', 'СТОЯК', 'СТРАЖ', 'СТРАЗ', 'СТРАХ', 'СТРИЖ', 'СТРОЙ', 'СТРОП', 'СТРУГ', 'СТРУП', 'СТРУЯ', 'СТУЖА', 'СТУПЬ', 'СТЫДЬ', 'СТЫНЬ', 'СУАРЕ', 'СУДАК', 'СУДНО', 'СУДОК', 'СУДЬЯ', 'СУЕТА', 'СУКНО', 'СУЛЕЯ', 'СУЛОЙ', 'СУМКА', 'СУММА', 'СУПЕР', 'СУПЕЦ', 'СУПИН', 'СУРЖА', 'СУРИК', 'СУРНА', 'СУРОК', 'СУСАК', 'СУСЕК', 'СУСЛО', 'СУТАЖ', 'СУТКИ', 'СУФЛЕ', 'СУЧОК', 'СУЧЬЕ', 'СУШКА', 'СФЕРА', 'СХЕМА', 'СХИМА', 'СЦЕНА', 'СЪЕЗД', 'СЫНОК', 'СЫПЕЦ', 'СЫРЕЦ', 'СЫРОК', 'СЫРТЬ', 'СЫРЦА', 'СЫРЬЕ', 'СЫЧУГ', 'СЫЩИК', 'СЮЖЕТ', 'СЮИТА', 'СЯБЕР', 'СЯЖОК', 'ТАБАК', 'ТАБЛО', 'ТАБОР', 'ТАБУН', 'ТАВОТ', 'ТАВРО', 'ТАГАН', 'ТАЗИК', 'ТАЙГА', 'ТАЙНА', 'ТАКСА', 'ТАКСИ', 'ТАКЫР', 'ТАЛЕР', 'ТАЛЕС', 'ТАЛИК', 'ТАЛИЯ', 'ТАЛОН', 'ТАЛЫШ', 'ТАЛЬК', 'ТАМГА', 'ТАНГО', 'ТАНЕЦ', 'ТАНИН', 'ТАНОК', 'ТАПЕР', 'ТАПИР', 'ТАПКА', 'ТАРАН', 'ТАРИФ', 'ТАРЫН', 'ТАСКА', 'ТАТКА', 'ТАФТА', 'ТАФЬЯ', 'ТАХТА', 'ТАЦЕТ', 'ТАЧКА', 'ТАШКА', 'ТВАРЬ', 'ТВИСТ', 'ТЕАТР', 'ТЕЗИС', 'ТЕЗКА', 'ТЕИЗМ', 'ТЕИСТ', 'ТЕКСТ', 'ТЕЛЕЦ', 'ТЕЛИК', 'ТЕЛКА', 'ТЕЛОК', 'ТЕМБР', 'ТЕМКА', 'ТЕНЕК', 'ТЕНОР', 'ТЕПЛО', 'ТЕРЕМ', 'ТЕРКА', 'ТЕРМЫ', 'ТЕРНО', 'ТЕСАК', 'ТЕСКА', 'ТЕСЛО', 'ТЕСТО', 'ТЕСТЬ', 'ТЕТКА', 'ТЕУРГ', 'ТЕЧКА', 'ТЕШКА', 'ТИАРА', 'ТИГРА', 'ТИМОЛ', 'ТИПАЖ', 'ТИПЕЦ', 'ТИПИК', 'ТИПУН', 'ТИРАЖ', 'ТИРАН', 'ТИСКИ', 'ТИТАН', 'ТИТЛО', 'ТИТУЛ', 'ТИФОН', 'ТИФУС', 'ТКАНЬ', 'ТЛЕНЬ', 'ТОВАР', 'ТОДЕС', 'ТОЙОН', 'ТОКАЙ', 'ТОЛАЙ', 'ТОЛПА', 'ТОЛЩА', 'ТОМАН', 'ТОМАТ', 'ТОМИК', 'ТОНДО', 'ТОНИК', 'ТОННА', 'ТОНУС', 'ТОПАЗ', 'ТОПИК', 'ТОПКА', 'ТОПОР', 'ТОПОТ', 'ТОРБА', 'ТОРЕЦ', 'ТОРИЙ', 'ТОРИТ', 'ТОРОС', 'ТОСКА', 'ТОТЕМ', 'ТОХАР', 'ТОЧКА', 'ТРАВА', 'ТРАКТ', 'ТРАНС', 'ТРАНШ', 'ТРАПП', 'ТРАСС', 'ТРАТА', 'ТРАУР', 'ТРЕБА', 'ТРЕЛЬ', 'ТРЕСК', 'ТРЕСТ', 'ТРЕТЬ', 'ТРЕУХ', 'ТРЕФА', 'ТРИАС', 'ТРИБА', 'ТРИЕР', 'ТРИКО', 'ТРИОД', 'ТРОМБ', 'ТРОМП', 'ТРОПА', 'ТРУБА', 'ТРУХА', 'ТРЮМО', 'ТУАЛЬ', 'ТУБУС', 'ТУГАЙ', 'ТУГУН', 'ТУЗИК', 'ТУКАН', 'ТУЛЕС', 'ТУЛИЙ', 'ТУЛУЗ', 'ТУЛУК', 'ТУЛУН', 'ТУЛУП', 'ТУЛЬЯ', 'ТУМАК', 'ТУМАН', 'ТУМБА', 'ТУНЕЦ', 'ТУПЕЙ', 'ТУПЕЦ', 'ТУПИК', 'ТУРАЧ', 'ТУРКА', 'ТУРНЕ', 'ТУРОК', 'ТУТОР', 'ТУТТИ', 'ТУФЛЯ', 'ТУЧКА', 'ТУШКА', 'ТЩЕТА', 'ТЫКВА', 'ТЫНОК', 'ТЫРЛО', 'ТЫРСА', 'ТЫЧОК', 'ТЮБИК', 'ТЮНИК', 'ТЮРБЕ', 'ТЮРБО', 'ТЮРИК', 'ТЮТЮН', 'ТЮФЯК', 'ТЮЧОК', 'ТЯБЛО', 'ТЯГАЧ', 'ТЯГЛО', 'ТЯЖБА', 'ТЯПКА', 'УАЗИК', 'УБРОД', 'УБРУС', 'УБЫЛЬ', 'УВРАЖ', 'УГОДА', 'УГОЛЬ', 'УГОРЬ', 'УГРЕВ', 'УДАЛЬ', 'УДАЧА', 'УДЕРЖ', 'УДИЛО', 'УДЭГЕ', 'УДЭХЕ', 'УЗБЕК', 'УЗИНА', 'УЗНИК', 'УЙГУР', 'УКЛАД', 'УКЛЕЯ', 'УКЛОН', 'УКРОП', 'УКРЮК', 'УКСУС', 'УЛИКА', 'УЛИТА', 'УЛИЦА', 'УЛЫБА', 'УМБРА', 'УМИЩЕ', 'УМНИК', 'УМОРА', 'УНИАТ', 'УНИКА', 'УНИОН', 'УНТЕР', 'УНЦИЯ', 'УПРЕК', 'УПЫРЬ', 'УРАЗА', 'УРЕМА', 'УРИНА', 'УРМАН', 'УСИНА', 'УСИЩЕ', 'УСКОК', 'УСПЕХ', 'УСТАВ', 'УСТОЙ', 'УСТУП', 'УСТЬЕ', 'УТЕРЯ', 'УТЕХА', 'УТИЛЬ', 'УТИЦА', 'УХАРЬ', 'УХВАТ', 'УХОЖЬ', 'УЧЕБА', 'УШИЦА', 'УШКАН', 'УШКУЙ', 'УШНИК', 'УЩЕРБ', 'ФАБРА', 'ФАВОР', 'ФАВУС', 'ФАГОТ', 'ФАДОМ', 'ФАЗАН', 'ФАЗИС', 'ФАКЕЛ', 'ФАКИР', 'ФАЛДА', 'ФАЛЬЦ', 'ФАНАТ', 'ФАРАД', 'ФАРСИ', 'ФАСАД', 'ФАСЕТ', 'ФАСКА', 'ФАСОН', 'ФАТУМ', 'ФАТЮЙ', 'ФАУНА', 'ФАЦИЯ', 'ФАЯНС', 'ФЕЛОН', 'ФЕНОЛ', 'ФЕРЗЬ', 'ФЕРМА', 'ФЕСКА', 'ФЕТИШ', 'ФЕТЮК', 'ФИАКР', 'ФИБРА', 'ФИЖМЫ', 'ФИЗИК', 'ФИЗИЯ', 'ФИКУС', 'ФИЛЕЙ', 'ФИЛЕР', 'ФИЛИН', 'ФИЛЬМ', 'ФИЛЬЦ', 'ФИМОЗ', 'ФИНАЛ', 'ФИНИК', 'ФИНИШ', 'ФИНКА', 'ФИННА', 'ФИОРД', 'ФИРМА', 'ФИТИН', 'ФИШКА', 'ФЛАНГ', 'ФЛАНК', 'ФЛЕЙТ', 'ФЛЕЙЦ', 'ФЛЕШЬ', 'ФЛИНТ', 'ФЛИРТ', 'ФЛОКС', 'ФЛОРА', 'ФЛЮИД', 'ФЛЯГА', 'ФОБИЯ', 'ФОКУС', 'ФОЛИО', 'ФОМКА', 'ФОРМА', 'ФОРТЕ', 'ФОРУМ', 'ФОСКА', 'ФОТОН', 'ФОФАН', 'ФРАЕР', 'ФРАЗА', 'ФРАНК', 'ФРАНТ', 'ФРАХТ', 'ФРЕЗА', 'ФРЕНЧ', 'ФРОНТ', 'ФРУКТ', 'ФУГАС', 'ФУЖЕР', 'ФУЗЕЯ', 'ФУКУС', 'ФУЛЯР', 'ФУРАЖ', 'ФУРИЯ', 'ФУРМА', 'ФУРОР', 'ФУТЕР', 'ФУТОР', 'ФУФЛО', 'ФУЭТЕ', 'ФЬОРД', 'ФЮРЕР', 'ХАБАР', 'ХАДЖИ', 'ХАДИС', 'ХАЗАР', 'ХАЙЛО', 'ХАКАС', 'ХАКЕР', 'ХАЛАТ', 'ХАЛВА', 'ХАЛДА', 'ХАЛИФ', 'ХАМИТ', 'ХАМКА', 'ХАМСА', 'ХАМЬЕ', 'ХАНЖА', 'ХАНША', 'ХАПУН', 'ХАРЧО', 'ХАСИД', 'ХАТКА', 'ХАШИШ', 'ХВАЛА', 'ХВОРЬ', 'ХВОСТ', 'ХЕДЕР', 'ХЕДИВ', 'ХЕРЕС', 'ХЕРИК', 'ХИАЗМ', 'ХИЛЯК', 'ХИМИК', 'ХИМИЯ', 'ХИНДИ', 'ХИНДУ', 'ХИНИН', 'ХИППИ', 'ХИТИН', 'ХИТОН', 'ХИ-ХИ', 'ХЛЕСТ', 'ХЛУПЬ', 'ХЛЫСТ', 'ХЛЮСТ', 'ХЛЯБЬ', 'ХМАРА', 'ХМАРЬ', 'ХМЕЛЬ', 'ХМУРЬ', 'ХОББИ', 'ХОБОТ', 'ХОДОК', 'ХОДУН', 'ХОЛКА', 'ХОЛОД', 'ХОЛОП', 'ХОЛСТ', 'ХОЛУЙ', 'ХОМУТ', 'ХОМЯК', 'ХОРАЛ', 'ХОРДА', 'ХОРЕЙ', 'ХОРЕК', 'ХОРЕЯ', 'ХОХМА', 'ХОХОЛ', 'ХОХОТ', 'ХРУСТ', 'ХРЯПА', 'ХРЯСК', 'ХРЯСТ', 'ХУНТА', 'ХУРАЛ', 'ХУРМА', 'ХУТОР', 'ЦАДИК', 'ЦАНГА', 'ЦАПКА', 'ЦАПЛЯ', 'ЦАПУН', 'ЦАПФА', 'ЦАРЕК', 'ЦАЦКА', 'ЦЕВКА', 'ЦЕВЬЕ', 'ЦЕДРА', 'ЦЕЗИЙ', 'ЦЕЛИК', 'ЦЕЛОЕ', 'ЦЕНТР', 'ЦЕХИН', 'ЦИКЛЯ', 'ЦИНГА', 'ЦИНИК', 'ЦИСТА', 'ЦИТРА', 'ЦИФРА', 'ЦОКОТ', 'ЦУКАТ', 'ЦУЦИК', 'ЦЫБИК', 'ЦЫГАН', 'ЦЫПКА', 'ЧАБАН', 'ЧАБЕР', 'ЧАБЕР', 'ЧАДРА', 'ЧАЙКА', 'ЧАКАН', 'ЧАЛКА', 'ЧАЛМА', 'ЧАРКА', 'ЧАСИК', 'ЧАСОК', 'ЧАСТЬ', 'ЧАШКА', 'ЧЕБАК', 'ЧЕБОТ', 'ЧЕКАН', 'ЧЕЛКА', 'ЧЕМЕР', 'ЧЕПАН', 'ЧЕПЕЦ', 'ЧЕРВА', 'ЧЕРВЬ', 'ЧЕРЕД', 'ЧЕРЕЗ', 'ЧЕРЕН', 'ЧЕРЕП', 'ЧЕРНЬ', 'ЧЕРТА', 'ЧЕСКА', 'ЧЕСТЬ', 'ЧЕТКА', 'ЧЕХОЛ', 'ЧЕЧЕН', 'ЧЕЧЕТ', 'ЧЕШКА', 'ЧЕШУЯ', 'ЧИБИС', 'ЧИЖИК', 'ЧИЛИМ', 'ЧИНАР', 'ЧИНКА', 'ЧИРЕЙ', 'ЧИРИК', 'ЧИРОК', 'ЧИРУС', 'ЧИРЯК', 'ЧИСЛО', 'ЧИТКА', 'ЧОМГА', 'ЧРЕВО', 'ЧРЕДА', 'ЧТИВО', 'ЧТИЦА', 'ЧУБИК', 'ЧУБУК', 'ЧУВАЛ', 'ЧУВАШ', 'ЧУВЯК', 'ЧУГУН', 'ЧУДАК', 'ЧУДИК', 'ЧУЖАК', 'ЧУЖАЯ', 'ЧУЖОЕ', 'ЧУЙКА', 'ЧУКЧА', 'ЧУЛАН', 'ЧУЛОК', 'ЧУМАК', 'ЧУРЕК', 'ЧУРКА', 'ЧУТЬЕ', 'ЧУХНА', 'ЧУШКА', 'ШАБАТ', 'ШАБЕР', 'ШАБЕР', 'ШАБЛИ', 'ШАБОТ', 'ШАБУР', 'ШАВКА', 'ШАЖОК', 'ШАЙБА', 'ШАЙКА', 'ШАКАЛ', 'ШАЛАШ', 'ШАЛОН', 'ШАЛУН', 'ШАМАН', 'ШАМОТ', 'ШАНЕЦ', 'ШАНКР', 'ШАПКА', 'ШАРИК', 'ШАСЛА', 'ШАССЕ', 'ШАССИ', 'ШАТЕН', 'ШАТЕР', 'ШАТИЯ', 'ШАТУН', 'ШАФЕР', 'ШАХТА', 'ШАШКА', 'ШВАЛЬ', 'ШВАНК', 'ШВЕРТ', 'ШЕВРО', 'ШЕЙКА', 'ШЕЛЕП', 'ШЕЛОМ', 'ШЕЛЬФ', 'ШЕМАЯ', 'ШЕПОТ', 'ШЕРИФ', 'ШИБЕР', 'ШИЗИК', 'ШИИЗМ', 'ШИММИ', 'ШИНОК', 'ШИПОК', 'ШИПУН', 'ШИРМА', 'ШИТВО', 'ШИТИК', 'ШИТЬЕ', 'ШИФЕР', 'ШИФОН', 'ШИХТА', 'ШИШАК', 'ШИШКА', 'ШКАЛА', 'ШКВАЛ', 'ШКЕРТ', 'ШКОДА', 'ШКОЛА', 'ШКУРА', 'ШЛАНГ', 'ШЛЕЙФ', 'ШЛИЦА', 'ШЛЮХА', 'ШЛЯПА', 'ШМЕЛЬ', 'ШМОЛЬ', 'ШНАПС', 'ШНЕКА', 'ШНЯВА', 'ШНЯКА', 'ШОРНЯ', 'ШОРОХ', 'ШОССЕ', 'ШОФЕР', 'ШПАГА', 'ШПАЛА', 'ШПАНА', 'ШПИЛЬ', 'ШПИОН', 'ШПОРА', 'ШПРИЦ', 'ШПРОТ', 'ШПУЛЯ', 'ШПУНТ', 'ШПЫНЬ', 'ШРИМС', 'ШРИФТ', 'ШТАМБ', 'ШТАММ', 'ШТАМП', 'ШТАНЫ', 'ШТЕЙН', 'ШТИЛЬ', 'ШТИФТ', 'ШТОРА', 'ШТОРМ', 'ШТОСС', 'ШТРАБ', 'ШТРАФ', 'ШТРЕК', 'ШТРИХ', 'ШТУКА', 'ШТУРМ', 'ШТЫКА', 'ШТЫРЬ', 'ШУБКА', 'ШУГАЙ', 'ШУЙЦА', 'ШУЛЕР', 'ШУМОК', 'ШУРИН', 'ШУРПА', 'ШУРУП', 'ШУРЯК', 'ШУТКА', 'ШУШУН', 'ШХУНА', 'ЩЕБЕТ', 'ЩЕГОЛ', 'ЩЕКОТ', 'ЩЕЛКА', 'ЩЕЛОК', 'ЩЕНОК', 'ЩЕПКА', 'ЩЕПЬЕ', 'ЩЕРБА', 'ЩЕТКА', 'ЩЕЧКА', 'ЩИПЕЦ', 'ЩИПКА', 'ЩИПОК', 'ЩИТИК', 'ЩИТОК', 'ЩУПИК', 'ЩУРКА', 'ЩУЧКА', 'ЭВЕНК', 'ЭГИДА', 'ЭГРЕТ', 'ЭДИКТ', 'ЭКЗОТ', 'ЭКЛЕР', 'ЭКРАН', 'ЭЛИТА', 'ЭЛЛИН', 'ЭМАЛЬ', 'ЭММЕР', 'ЭНЗИМ', 'ЭОЛИТ', 'ЭПИКА', 'ЭПОНЖ', 'ЭПОХА', 'ЭРЗАЦ', 'ЭРКЕР', 'ЭСКИЗ', 'ЭСПРИ', 'ЭСТЕТ', 'ЭТИКА', 'ЭТНОС', 'ЭФИОП', 'ЭШАРП', 'ЮГРИЧ', 'ЮГУРТ', 'ЮДОЛЬ', 'ЮЗИСТ', 'ЮКОЛА', 'ЮНИОР', 'ЮНИЦА', 'ЮНКЕР', 'ЮНКОР', 'ЮННАТ', 'ЮНОША', 'ЮРАГА', 'ЮРИСТ', 'ЮФЕРС', 'ЯБЕДА', 'ЯГЕЛЬ', 'ЯГОДА', 'ЯГУАР', 'ЯИЧКО', 'ЯИШНЯ', 'ЯКОРЬ', 'ЯМИНА', 'ЯМИЩА', 'ЯМЩИК', 'ЯРИЦА', 'ЯРЛЫК', 'ЯРУГА', 'ЯРЫГА', 'ЯСЕНЬ', 'ЯСПИС', 'ЯСТВО', 'ЯСТЫК', 'ЯСЫРЬ', 'ЯТОВЬ', 'ЯХОНТ'];

let word, 
    letters;

let challenge = window.location.search.substring(1); 
challenge = challenge.split('challenge=');
challenge.shift();
challenge = challenge.join();
challenge = dec(challenge, 'CEvXrD');

if (challenge) {
    if (challenge.length == 5) {
        word = challenge.toUpperCase(); 
        if (wordsAll.includes(word) == false) {
            wordsAll.push(word);
        }
    }
    else {
        word = words[getRandomInt(0, words.length)];
    }
}
else {
    word = words[getRandomInt(0, words.length)];
}

letters = word.toUpperCase().split('');

console.log(letters);

 
let cells = [],
    cellsCount = 0, 
    cellsMax = 5; 

let colorBlocks = [],
    colorBlocksEnter = [],
    colorBlocksEnterCount,
    colorBlocksEnterResult = [],
    colorBlocksEnterResultText,
    colorBlocksEnterResultVk,
    colorBlocksEnterResultCopy,
    colorKeys = [],
    letterKeys = [],
    allColorKeys = [],
    allLetterKeys = [],
    keysCounter = 0;

let keyX = 46,
    keyY = 66,
    keyBoardX = 43,
    keyBoardY = 58,
    keysSize = 20, 
    blockSize = 70, 
    blockBoard = 62,
    blockShift = 0; 

let allBoardContainers = [],
	allKeysContainers = [];

let start = document.querySelector('.start'),
    tutorial = document.querySelector('.tutorial'),
    close = document.querySelector('.tutorial .close'),
    result = document.querySelector('.modal_finish.poof'),
    canvas = document.querySelector('canvas'),
    winTitle = document.querySelector('.modal_finish.poof .top'),
    winShare = document.querySelector('.modal_finish.poof .block_share'),
    winPuzzle = document.querySelector('.modal_finish.poof .puzzle'),
    loseDesc = document.querySelector('.modal_finish.poof .desc'),
    loseWord = document.querySelector('.modal_finish.poof .word'),
    popup = document.querySelector('.popup'),
    guess = document.querySelector('.guess'),
    stats = document.getElementById('modal_stats'),
    stats_close = document.querySelector('#modal_stats .close'),
    statsPlayed = document.querySelector('#modal_stats .played .val'),
    statsWin = document.querySelector('#modal_stats .win .val'),
    statsPercent = document.querySelector('#modal_stats .percent .val'),
    statsStreak = document.querySelector('#modal_stats .streak .val'),
    langs = document.getElementById('modal_languages'),
    langs_close = document.querySelector('#modal_languages .close'),
    tries1Percent = document.querySelector('#modal_stats .chart .tries1 .percentage'),
    tries1Amount = document.querySelector('#modal_stats .chart .tries1  .amount'),
    tries2Percent = document.querySelector('#modal_stats .chart .tries2 .percentage'),
    tries2Amount = document.querySelector('#modal_stats .chart .tries2 .amount'),
    tries3Percent = document.querySelector('#modal_stats .chart .tries3 .percentage'),
    tries3Amount = document.querySelector('#modal_stats .chart .tries3 .amount'),
    tries4Percent = document.querySelector('#modal_stats .chart .tries4 .percentage'),
    tries4Amount = document.querySelector('#modal_stats .chart .tries4 .amount'),
    tries5Percent = document.querySelector('#modal_stats .chart .tries5 .percentage'),
    tries5Amount = document.querySelector('#modal_stats .chart .tries5 .amount'),
    tries6Percent = document.querySelector('#modal_stats .chart .tries6 .percentage'),
    tries6Amount = document.querySelector('#modal_stats .chart .tries6 .amount'),
    puzzle = document.querySelector('.modal_finish .puzzle a'),
    screen = document.querySelector('.modal_finish .download-screenshot'),
    shareBtns = document.querySelectorAll('#st-1.st-has-labels .st-btn span'),
    guessChallenge = document.querySelector('.modal_finish .challenge a'),
    generator = document.querySelector('.modal_finish.word_generator'),
    generatorInput = document.querySelector('.modal_finish.word_generator .input'),
    generatorBtn = document.querySelector('.modal_finish.word_generator .copy_btn'),
    generatorNoValid = document.querySelector('.modal_finish.word_generator .not_valid'),
    generatorValid = document.querySelector('.modal_finish.word_generator .valid');

let gamesPlayed = localStorage['gamesPlayed_ru'] || '0',
    gamesWin = localStorage['gamesWin_ru'] || '0',
    percentWin = localStorage['percentWin_ru'] || '0',
    maxStreak = localStorage['gamesWin_ru'] || '0',
    tries1 = localStorage['tries1_ru'] || '0',
    tries2 = localStorage['tries2_ru'] || '0',
    tries3 = localStorage['tries3_ru'] || '0',
    tries4 = localStorage['tries4_ru'] || '0',
    tries5 = localStorage['tries5_ru'] || '0',
    tries6 = localStorage['tries6_ru'] || '0';
    
if (widthMain < 600) {
    keyX = keyX*widthMain/610;
    keyBoardX = keyBoardX*widthMain/610;
    canvasWidth = widthMain;
    shareBtns.forEach((elem) => elem.remove());
}
if (widthMain < 500) {
    blockSize = blockSize*320/500;
    blockBoard = blockBoard*320/500;
    canvasHeight -= 170;
}

const styleTitle= new PIXI.TextStyle({
    fontFamily: 'Clear Sans',
    fontSize: 50,
    fontWeight: '700',
    fill: ['#000000'],
});

const styleBold= new PIXI.TextStyle({
    fontFamily: 'Clear Sans',
    fontSize: keysSize,
    fontWeight: '700',
    fill: ['#000000'],
}); 

let borderLevel = new PIXI.Graphics();

const app = new PIXI.Application({ 
    view: mainCanvas, 
    width: canvasWidth,
    height: canvasHeight,
    backgroundColor: 0xffffff,
    resolution: 1
});

app.autoPreventDefault = false;
app.view.style.touchAction = 'auto';

const container = new PIXI.Container({ uvs: true });

const containerHeader = new PIXI.Container();
const containerBoard = new PIXI.Container();
const containerKeyboard = new PIXI.Container();

window.addEventListener(`resize`, event => {
    reset();
    init(); 
});

function reset() {
	app.stage.removeChild(container); 
	container.removeChild(containerHeader);
	container.removeChild(containerBoard);
	borderLevel.clear();
	containerHeader.removeChild(borderLevel);
	stats_close.removeEventListener('click', statsBtn, false);
    close.removeEventListener('click', tutorialBtn, false);
	allKeysContainers.length = 0;
	allColorKeys.forEach( (elem) => elem.clear());
	allColorKeys.length = 0;
	allLetterKeys.forEach( (elem) => elem.text = '');
	allLetterKeys.length = 0;
}


function init() {

    puzzle.innerHTML = '<svg class="icon" aria-hidden="true" focusable="false" data-prefix="fas" data-icon="th" class="svg-inline--fa fa-th fa-w-16" role="img" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512"><path fill="currentColor" d="M149.333 56v80c0 13.255-10.745 24-24 24H24c-13.255 0-24-10.745-24-24V56c0-13.255 10.745-24 24-24h101.333c13.255 0 24 10.745 24 24zm181.334 240v-80c0-13.255-10.745-24-24-24H205.333c-13.255 0-24 10.745-24 24v80c0 13.255 10.745 24 24 24h101.333c13.256 0 24.001-10.745 24.001-24zm32-240v80c0 13.255 10.745 24 24 24H488c13.255 0 24-10.745 24-24V56c0-13.255-10.745-24-24-24H386.667c-13.255 0-24 10.745-24 24zm-32 80V56c0-13.255-10.745-24-24-24H205.333c-13.255 0-24 10.745-24 24v80c0 13.255 10.745 24 24 24h101.333c13.256 0 24.001-10.745 24.001-24zm-205.334 56H24c-13.255 0-24 10.745-24 24v80c0 13.255 10.745 24 24 24h101.333c13.255 0 24-10.745 24-24v-80c0-13.255-10.745-24-24-24zM0 376v80c0 13.255 10.745 24 24 24h101.333c13.255 0 24-10.745 24-24v-80c0-13.255-10.745-24-24-24H24c-13.255 0-24 10.745-24 24zm386.667-56H488c13.255 0 24-10.745 24-24v-80c0-13.255-10.745-24-24-24H386.667c-13.255 0-24 10.745-24 24v80c0 13.255 10.745 24 24 24zm0 160H488c13.255 0 24-10.745 24-24v-80c0-13.255-10.745-24-24-24H386.667c-13.255 0-24 10.745-24 24v80c0 13.255 10.745 24 24 24zM181.333 376v80c0 13.255 10.745 24 24 24h101.333c13.255 0 24-10.745 24-24v-80c0-13.255-10.745-24-24-24H205.333c-13.255 0-24 10.745-24 24z"></path></svg>Скопировать результат с эмоджи';
    guessChallenge.innerHTML = '<svg class="icon" aria-hidden="true" focusable="false" data-prefix="fas" data-icon="link" class="svg-inline--fa fa-link fa-w-16" role="img" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512"><path fill="currentColor" d="M326.612 185.391c59.747 59.809 58.927 155.698.36 214.59-.11.12-.24.25-.36.37l-67.2 67.2c-59.27 59.27-155.699 59.262-214.96 0-59.27-59.26-59.27-155.7 0-214.96l37.106-37.106c9.84-9.84 26.786-3.3 27.294 10.606.648 17.722 3.826 35.527 9.69 52.721 1.986 5.822.567 12.262-3.783 16.612l-13.087 13.087c-28.026 28.026-28.905 73.66-1.155 101.96 28.024 28.579 74.086 28.749 102.325.51l67.2-67.19c28.191-28.191 28.073-73.757 0-101.83-3.701-3.694-7.429-6.564-10.341-8.569a16.037 16.037 0 0 1-6.947-12.606c-.396-10.567 3.348-21.456 11.698-29.806l21.054-21.055c5.521-5.521 14.182-6.199 20.584-1.731a152.482 152.482 0 0 1 20.522 17.197zM467.547 44.449c-59.261-59.262-155.69-59.27-214.96 0l-67.2 67.2c-.12.12-.25.25-.36.37-58.566 58.892-59.387 154.781.36 214.59a152.454 152.454 0 0 0 20.521 17.196c6.402 4.468 15.064 3.789 20.584-1.731l21.054-21.055c8.35-8.35 12.094-19.239 11.698-29.806a16.037 16.037 0 0 0-6.947-12.606c-2.912-2.005-6.64-4.875-10.341-8.569-28.073-28.073-28.191-73.639 0-101.83l67.2-67.19c28.239-28.239 74.3-28.069 102.325.51 27.75 28.3 26.872 73.934-1.155 101.96l-13.087 13.087c-4.35 4.35-5.769 10.79-3.783 16.612 5.864 17.194 9.042 34.999 9.69 52.721.509 13.906 17.454 20.446 27.294 10.606l37.106-37.106c59.271-59.259 59.271-155.699.001-214.959z"></path></svg>Скопировать ссылку на это слово';

    colorBlocksEnterCount = 0;

    colorBlocksEnter = [];

    document.addEventListener('keydown', pressKeys);

    generatorBtn.addEventListener("click", generatorFunc);

	app.stage.addChild(container);

	container.x = app.screen.width / 2;

	container.addChild(containerBoard);
	container.addChild(containerKeyboard);

	close.addEventListener("click", tutorialBtn);
    stats_close.addEventListener("click", statsBtn);
    langs_close.addEventListener("click", langsBtn);

    statsPlayed.innerHTML = gamesPlayed;
    statsWin.innerHTML = gamesWin;
    statsPercent.innerHTML = percentWin;
    statsStreak.innerHTML = maxStreak;

    if (tries1 > 0) {
        tries1Amount.innerHTML = tries1;
        tries1Percent.innerHTML = `<span style="width: ${tries1*100/gamesWin}%;">${Math.round(tries1*100/gamesWin)}%</span>`;
    }
    if (tries2 > 0) {
        tries2Amount.innerHTML = tries2;
        tries2Percent.innerHTML = `<span style="width: ${tries2*100/gamesWin}%;">${Math.round(tries2*100/gamesWin)}%</span>`;
    }
    if (tries3 > 0) {
        tries3Amount.innerHTML = tries3;
        tries3Percent.innerHTML = `<span style="width: ${tries3*100/gamesWin}%;">${Math.round(tries3*100/gamesWin)}%</span>`;
    }
    if (tries4 > 0) {
        tries4Amount.innerHTML = tries4;
        tries4Percent.innerHTML = `<span style="width: ${tries4*100/gamesWin}%;">${Math.round(tries4*100/gamesWin)}%</span>`;
    }
    if (tries5 > 0) {
        tries5Amount.innerHTML = tries5;
        tries5Percent.innerHTML = `<span style="width: ${tries5*100/gamesWin}%;">${Math.round(tries5*100/gamesWin)}%</span>`;
    }
    if (tries6 > 0) {
        tries6Amount.innerHTML = tries6;
        tries6Percent.innerHTML = `<span style="width: ${tries6*100/gamesWin}%;">${Math.round(tries6*100/gamesWin)}%</span>`;
    }

	for (let i = 0; i < 30; i++) {
	    let container = new PIXI.Container(); 
	    let block = new PIXI.Graphics();

	    block.lineStyle(2, 0xD3D6DA);
        block.drawRoundedRect(0, 0, blockBoard, blockBoard, 4);              
	    block.endFill();  

	    colorBlocks.push(block);
	    
	    container.x = (i % 5) * blockSize;
	    container.y = Math.floor(i / 5) * blockSize;
	    container.addChild(block);
	    
	    let text = new PIXI.Text("");
	    text.resolution = 2;
	    cells.push(text);
	    text.anchor.set(0.5);
	    text.x = container.width / 2;
	    text.y = container.height / 2;
	    container.addChild(text);

	    allBoardContainers.push(container);
	    
	    containerBoard.addChild(container);
	}

	containerBoard.x = -containerBoard.width / 2;

	for (let i = 0; i < 35; i++) {
	    let container = new PIXI.Container({uvs: true});
	    let block = new PIXI.Graphics();
	    
	    if (i < 12) {
	        container.x = (i % 12) * keyX*13/12-keyX/2;
	        container.y = Math.floor(i / 12) * keyY;
	        block.beginFill(0xD3D6DA, 1);
	        block.drawRoundedRect(0, 0, keyBoardX*13/12, keyBoardY, 4);            
	        block.endFill();  
	    }
	    else if (i > 23) {
	        container.x = (i % 12) * keyX+keyX/2;
	        container.y = Math.floor(i / 12) * keyY;
	        block.beginFill(0xD3D6DA, 1);
	        block.drawRoundedRect(0, 0, keyBoardX, keyBoardY, 4);            
	        block.endFill();  
	    }
	    else {
	        container.x = (i % 11) * keyX*13/11-keyX/2;
	        container.y = Math.floor(i / 12) * keyY;
	        block.beginFill(0xD3D6DA, 1);
	        block.drawRoundedRect(0, 0, keyBoardX*13/11, keyBoardY, 4);            
	        block.endFill();  
	    }

	    if (i == 24) {
	        block.beginFill(0xD3D6DA, 1);
	        block.drawRoundedRect(-keyBoardX, 0, keyBoardX*2, keyBoardY, 4);            
	        block.endFill();  
	    }
	    else if (i == 34) {
	        block.beginFill(0xD3D6DA, 1);
	        block.drawRoundedRect(0, 0, keyBoardX*2, keyBoardY, 4);            
	        block.endFill();  
	    }
	    
	    container.addChild(block);

	    const style = new PIXI.TextStyle({
	        fontFamily: 'Clear Sans',
	        fontSize: keysSize,
	        fontWeight: '700',
	        fill: ['#000000'],
	    });

	    let text = new PIXI.Text(keys[i], style);
	    text.anchor.set(0.5);
	    text.resolution = 2;

	    if (i == 24) {
	        text.x = 0;
			if (widthMain < 680) {
			    text.style.fontSize = 14;
			}	
	    }
	    else if (i == 34) {
	        text.x = container.width/2; 
	        text.style.fontSize = keysSize + 10;
	    }
	    else {
	        text.x = container.width / 2; 
	    }
	    
	    text.y = container.height / 2;
    
	    container.addChild(text);

	    allColorKeys.push(block);
	    allLetterKeys.push(text);
	    
	    container.interactive = true;
	    container.buttonMode = true;
	    container.on("pointerdown", function () {
	        if (i == 24) {
	            enterCheck();
	        }
	        else if (i == 34) {
	            if (cellsCount > cellsMax - 5) {   
	                cells[cellsCount-1].text = '';
	                cellsCount--;
	                colorKeys.pop();
	                letterKeys.pop();
	            }
	        }
	        else {
	            enterKey(keys[i]);
	        }
	    });

	    allKeysContainers.push(container);
	    
	    containerKeyboard.addChild(container);
	}

	containerKeyboard.x = -containerKeyboard.width / 2 + keyBoardX/2;
	containerKeyboard.y = (app.screen.height - containerKeyboard.height - 10);

}

function restartGame() {
	app.stage.removeChild(container);
	container.removeChild(containerHeader);
	container.removeChild(containerBoard);
	container.removeChild(containerKeyboard);
	borderLevel.clear();
	containerHeader.removeChild(borderLevel);
	stats_close.removeEventListener('click', statsBtn, false);
    close.removeEventListener('click', tutorialBtn, false);
    screen.removeEventListener("click", screenShot);
	guessChallenge.removeEventListener("click", guessChallengeFunc);
	puzzle.removeEventListener("click", puzzleCopy);

	word = words[getRandomInt(0, words.length)];
    letters = word.toUpperCase().split('');
    console.log(letters);
 
	allBoardContainers.length = 0;
	allKeysContainers.length = 0;
	colorBlocks.forEach( (elem) => elem.clear());
	colorBlocks.length = 0;
	allColorKeys.forEach( (elem) => elem.clear());
	allColorKeys.length = 0;
	allLetterKeys.forEach( (elem) => elem.text = '');
	allLetterKeys.length = 0;
	cells.forEach( (elem) => elem.text = '');
	cells.length = 0;
	colorKeys.forEach( (elem) => elem.clear());
	colorKeys.length = 0;
	letterKeys.forEach( (elem) => elem.text = '');
	letterKeys.length = 0;

    cellsCount = 0;
    cellsMax = 5;
    keysCounter = 0;

	init();
	result.classList.toggle('active');
}

function enterKey(text){
    if (cellsCount < cellsMax) {
        cells[cellsCount].text = text;
        cellsCount++;
        if (text == 'Ы') {
            colorKeys.push(allColorKeys[23]);
            letterKeys.push(allLetterKeys[23]);
        }
        else {  
            colorKeys.push(allColorKeys[keys.indexOf(text)]);
            letterKeys.push(allLetterKeys[keys.indexOf(text)]);
        }
    }
}

function enterCheck(){
    let enterWord = '';
    for (let i = 5; i > 0; i--) {
        enterWord += cells[cellsMax-i].text;
    }
    if (cellsCount == cellsMax) {
        if (wordsAll.includes(enterWord)) {
            let countRight = 0,
                countRightCheck = 0;
            let counts = {},
                countsRepeat = [];
            letters.forEach(function(x) { 
                counts[x] = (counts[x] || 0)+1;
                if (counts[x] > 1) {
                    countsRepeat.push(x);
                }
            });
            let repeat = [];
            let enterWord = [];
            for (let i = 5; i > 0; i--) {
                colorBlocks[cellsMax-i].clear();
                enterWord.push(cells[cellsMax-i].text);
                cells[cellsMax-i].style.fill = ['#FFFFFF'];
                if (letters.includes(cells[cellsMax-i].text)) {
                    if (counts[cells[cellsMax-i].text] > 0) {
                        if (cells[cellsMax-i].text == letters[5-i]) {
                            colorBlocks[cellsMax-i].beginFill(0x6AAA64);
                            colorBlocks[cellsMax-i].drawRect(0, 0, blockBoard, blockBoard);
                            colorBlocks[cellsMax-i].endFill();
                            colorBlocksEnter.push('🟩');
                            countRight++;
                            let widthKey =  colorKeys[5-i+keysCounter].width;
                            colorKeys[5-i+keysCounter].clear();
                            colorKeys[5-i+keysCounter].beginFill(0x6AAA64);
                            colorKeys[5-i+keysCounter].drawRoundedRect(0, 0, widthKey, keyBoardY, 4);
                            letterKeys[5-i+keysCounter].style.fill = ['#FFFFFF'];
                            if (countRight == 5) {
                                winTitle.innerHTML = 'Победа!';
                                loseWord.innerHTML = `<span>${word}</span>`;
                                winShare.style.display = 'block';
                                winPuzzle.style.display = 'block';
                                loseDesc.style.display = 'none';
                                loseWord.style.display = 'none';
                                result.classList.toggle('active');

                                gamesWin++;
                                localStorage['gamesWin_ru'] = gamesWin;
                                gamesPlayed++;
                                localStorage['gamesPlayed_ru'] = gamesPlayed;
                                percentWin = Math.round(gamesWin*100/gamesPlayed);
                                localStorage['percentWin_ru'] = percentWin;
                                maxStreak = gamesWin;

                                if ((cellsMax)/5 == 1) {
                                    tries1++;
                                    localStorage['tries1_ru'] = tries1;
                                }
                                else if ((cellsMax)/5 == 2) {
                                    tries2++;
                                    localStorage['tries2_ru'] = tries2;
                                }
                                else if ((cellsMax)/5 == 3) { 
                                    tries3++;
                                    localStorage['tries3_ru'] = tries3;
                                }
                                else if ((cellsMax)/5 == 4) {
                                    tries4++;
                                    localStorage['tries4_ru'] = tries4;
                                }
                                else if ((cellsMax)/5 == 5) {
                                    tries5++;
                                    localStorage['tries5_ru'] = tries5;
                                }
                                else if ((cellsMax)/5 == 6) {
                                    tries6++; 
                                    localStorage['tries6_ru'] = tries6;
                                }

                                colorBlocksEnterResult = [];

                                colorBlocksEnterResultText = '';
                                colorBlocksEnterResultVk = '';
                                colorBlocksEnterResultCopy = '';
 
                                while(colorBlocksEnter.length) colorBlocksEnterResult.push(colorBlocksEnter.splice(0,5).join(''));
                                
                                colorBlocksEnterResult.forEach( (elem) => colorBlocksEnterResultText += `%0A${elem}`);
                                colorBlocksEnterResult.forEach( (elem) => colorBlocksEnterResultVk += `%20->${elem}`);

                                colorBlocksEnterResult.forEach( (elem) => colorBlocksEnterResultCopy += `\n${elem}`);

                                document.removeEventListener('keydown', pressKeys);

                                puzzle.addEventListener("click", puzzleCopy);
                                screen.addEventListener("click", screenShot);
								guessChallenge.addEventListener("click", guessChallengeFunc);
                            }
                            
                        }
                        else{
                            colorBlocks[cellsMax-i].beginFill(0xC9B458);
                            colorBlocks[cellsMax-i].drawRect(0, 0, blockBoard, blockBoard);
                            colorBlocks[cellsMax-i].endFill();
                            colorBlocksEnter.push('🟨');
                            colorBlocksEnterCount = colorBlocksEnter.length;
                            if (colorKeys[5-i+keysCounter].fill.color != 6990436) {  
                            	let widthKey = colorKeys[5-i+keysCounter].width;
                                colorKeys[5-i+keysCounter].clear();
                                colorKeys[5-i+keysCounter].beginFill(0xC9B458);
                                colorKeys[5-i+keysCounter].drawRoundedRect(0, 0, widthKey, keyBoardY, 4);
                                letterKeys[5-i+keysCounter].style.fill = ['#FFFFFF'];
                            }
                        }
                        counts[cells[cellsMax-i].text]--;
                    }
                    else {
                        colorBlocks[cellsMax-i].beginFill(0x787C7E);
                        colorBlocks[cellsMax-i].drawRect(0, 0, blockBoard, blockBoard);
                        colorBlocks[cellsMax-i].endFill();
                        colorBlocksEnter.push('⬛');

                        if (cells[cellsMax-i].text == letters[5-i]) {
                            colorBlocks[cellsMax-i].beginFill(0x6AAA64);
                            colorBlocks[cellsMax-i].drawRect(0, 0, blockBoard, blockBoard);
                            colorBlocks[cellsMax-i].endFill();
                            colorBlocksEnter.push('🟩');
                            countRight++;
                            if (countRight == 5) {
                                winTitle.innerHTML = 'Победа!';
                                loseWord.innerHTML = `<span>${word}</span>`;
                                winShare.style.display = 'block';
                                winPuzzle.style.display = 'block';
                                loseDesc.style.display = 'none';
                                loseWord.style.display = 'none';
                                result.classList.toggle('active');

                                gamesWin++;
                                localStorage['gamesWin_ru'] = gamesWin;
                                gamesPlayed++;
                                localStorage['gamesPlayed_ru'] = gamesPlayed;
                                percentWin = Math.round(gamesWin*100/gamesPlayed);
                                localStorage['percentWin_ru'] = percentWin;
                                maxStreak = gamesWin;

                                if ((cellsMax)/5 == 1) {
                                    tries1++;
                                    localStorage['tries1_ru'] = tries1;
                                }
                                else if ((cellsMax)/5 == 2) {
                                    tries2++;
                                    localStorage['tries2_ru'] = tries2;
                                }
                                else if ((cellsMax)/5 == 3) { 
                                    tries3++;
                                    localStorage['tries3_ru'] = tries3;
                                }
                                else if ((cellsMax)/5 == 4) {
                                    tries4++;
                                    localStorage['tries4_ru'] = tries4;
                                }
                                else if ((cellsMax)/5 == 5) {
                                    tries5++;
                                    localStorage['tries5_ru'] = tries5;
                                }
                                else if ((cellsMax)/5 == 6) {
                                    tries6++;
                                    localStorage['tries6_ru'] = tries6;
                                }

                                colorBlocksEnterResult = [];

                                colorBlocksEnterResultText = '';
                                colorBlocksEnterResultVk = '';
                                colorBlocksEnterResultCopy = '';

                                while(colorBlocksEnter.length) colorBlocksEnterResult.push(colorBlocksEnter.splice(0,5).join(''));
                                
                                colorBlocksEnterResult.forEach( (elem) => colorBlocksEnterResultText += `%0A${elem}`);
                                colorBlocksEnterResult.forEach( (elem) => colorBlocksEnterResultVk += `%20->${elem}`);

                                colorBlocksEnterResult.forEach( (elem) => colorBlocksEnterResultCopy += `\n${elem}`);

                                document.removeEventListener('keydown', pressKeys);

                                puzzle.addEventListener("click", puzzleCopy);
                                screen.addEventListener("click", screenShot);
								guessChallenge.addEventListener("click", guessChallengeFunc);
                            }
                            let firstLet = 6;
                            enterWord.some(function(elem){
                                firstLet--;
                                if (elem == cells[cellsMax-i].text) {
                                    colorBlocks[cellsMax-firstLet].beginFill(0x787C7E);
                                    colorBlocks[cellsMax-firstLet].drawRect(0, 0, blockBoard, blockBoard);
                                    colorBlocks[cellsMax-firstLet].endFill();
                                    colorBlocksEnter.splice(colorBlocksEnterCount-1, 1);
                                    return elem;
                                }
                            });
                        }
                    }
                }
                else {
                    colorBlocks[cellsMax-i].beginFill(0x787C7E);
                    colorBlocks[cellsMax-i].drawRect(0, 0, blockBoard, blockBoard);
                    colorBlocks[cellsMax-i].endFill();
                    colorBlocksEnter.push('⬛');
                    let widthKey =  colorKeys[5-i+keysCounter].width;
                    colorKeys[5-i+keysCounter].clear();
                    colorKeys[5-i+keysCounter].beginFill(0x787C7E);
                    colorKeys[5-i+keysCounter].drawRoundedRect(0, 0, widthKey, keyBoardY, 4);
                    letterKeys[5-i+keysCounter].style.fill = ['#FFFFFF'];
                }
            }
           
            cellsMax += 5;
            keysCounter += 5;
            if ((cellsMax == 35) & (countRight != 5)) {
                winTitle.innerHTML = 'Не расстраивайтесь!';
                loseWord.innerHTML = `<span>${word}</span>`;
                winShare.style.display = 'none';
                winPuzzle.style.display = 'none';
                loseDesc.style.display = 'block';
                loseWord.style.display = 'block';
                result.classList.toggle('active');

                gamesPlayed++;
                localStorage['gamesPlayed_ru'] = gamesPlayed;
                percentWin = Math.round(gamesWin*100/gamesPlayed);
                localStorage['percentWin_ru'] = percentWin;
                maxStreak = gamesWin;

                document.removeEventListener('keydown', pressKeys);

                screen.addEventListener("click", screenShot);
				guessChallenge.addEventListener("click", guessChallengeFunc);
            }

        }
        else {
            popup.innerHTML = 'Нет такого слова!';
            popup.classList.toggle('active');
            setTimeout(function() {
                popup.classList.toggle('active');
            }, 1000);
        }
    }
    else {
        popup.innerHTML = 'Недостаточно букв!';
        popup.classList.toggle('active');
        setTimeout(function() {
            popup.classList.toggle('active');
        }, 1000);
    }
}

function screenShot() {
	let appWidth = app.screen.width,
        appHeight = app.screen.height,
        containerX = container.x,
        containerY = container.y;
    container.removeChild(containerKeyboard);
    app.renderer.resize(containerBoard.width*5+10, containerBoard.height*5+10);
    container.scale.set(5);
    container.x = app.screen.width / 2;
    container.y = 5;

	app.render();
    var data = app.view.toDataURL("image/png", 1);
    var link = document.createElement("a");    
    link.setAttribute("href", data);
    link.setAttribute("download", "wordlegame");
    link.click();
    link.remove(); 
    container.scale.set(1);
    container.addChild(containerKeyboard);
    app.renderer.resize(appWidth, appHeight);
    container.x = containerX;
    container.y = containerY;
}

function guessChallengeFunc() {
    let crypted = enc(word, 'CEvXrD');
    copyToClipboard( 'Сможешь ли ты разгадать это русское слово? ' + window.location.origin + window.location.pathname +  `?challenge=${crypted}`)
        .then(() => guessChallenge.innerHTML = '<svg class="icon" aria-hidden="true" focusable="false" data-prefix="fas" data-icon="link" class="svg-inline--fa fa-link fa-w-16" role="img" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512"><path fill="currentColor" d="M326.612 185.391c59.747 59.809 58.927 155.698.36 214.59-.11.12-.24.25-.36.37l-67.2 67.2c-59.27 59.27-155.699 59.262-214.96 0-59.27-59.26-59.27-155.7 0-214.96l37.106-37.106c9.84-9.84 26.786-3.3 27.294 10.606.648 17.722 3.826 35.527 9.69 52.721 1.986 5.822.567 12.262-3.783 16.612l-13.087 13.087c-28.026 28.026-28.905 73.66-1.155 101.96 28.024 28.579 74.086 28.749 102.325.51l67.2-67.19c28.191-28.191 28.073-73.757 0-101.83-3.701-3.694-7.429-6.564-10.341-8.569a16.037 16.037 0 0 1-6.947-12.606c-.396-10.567 3.348-21.456 11.698-29.806l21.054-21.055c5.521-5.521 14.182-6.199 20.584-1.731a152.482 152.482 0 0 1 20.522 17.197zM467.547 44.449c-59.261-59.262-155.69-59.27-214.96 0l-67.2 67.2c-.12.12-.25.25-.36.37-58.566 58.892-59.387 154.781.36 214.59a152.454 152.454 0 0 0 20.521 17.196c6.402 4.468 15.064 3.789 20.584-1.731l21.054-21.055c8.35-8.35 12.094-19.239 11.698-29.806a16.037 16.037 0 0 0-6.947-12.606c-2.912-2.005-6.64-4.875-10.341-8.569-28.073-28.073-28.191-73.639 0-101.83l67.2-67.19c28.239-28.239 74.3-28.069 102.325.51 27.75 28.3 26.872 73.934-1.155 101.96l-13.087 13.087c-4.35 4.35-5.769 10.79-3.783 16.612 5.864 17.194 9.042 34.999 9.69 52.721.509 13.906 17.454 20.446 27.294 10.606l37.106-37.106c59.271-59.259 59.271-155.699.001-214.959z"></path></svg>Ссылка скопирована!')
        .catch(() => console.log('error')); 
} 

function puzzleCopy(e) {
    copyToClipboard(colorBlocksEnterResultCopy)
        .then(() => puzzle.innerHTML = '<svg class="icon" aria-hidden="true" focusable="false" data-prefix="fas" data-icon="th" class="svg-inline--fa fa-th fa-w-16" role="img" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512"><path fill="currentColor" d="M149.333 56v80c0 13.255-10.745 24-24 24H24c-13.255 0-24-10.745-24-24V56c0-13.255 10.745-24 24-24h101.333c13.255 0 24 10.745 24 24zm181.334 240v-80c0-13.255-10.745-24-24-24H205.333c-13.255 0-24 10.745-24 24v80c0 13.255 10.745 24 24 24h101.333c13.256 0 24.001-10.745 24.001-24zm32-240v80c0 13.255 10.745 24 24 24H488c13.255 0 24-10.745 24-24V56c0-13.255-10.745-24-24-24H386.667c-13.255 0-24 10.745-24 24zm-32 80V56c0-13.255-10.745-24-24-24H205.333c-13.255 0-24 10.745-24 24v80c0 13.255 10.745 24 24 24h101.333c13.256 0 24.001-10.745 24.001-24zm-205.334 56H24c-13.255 0-24 10.745-24 24v80c0 13.255 10.745 24 24 24h101.333c13.255 0 24-10.745 24-24v-80c0-13.255-10.745-24-24-24zM0 376v80c0 13.255 10.745 24 24 24h101.333c13.255 0 24-10.745 24-24v-80c0-13.255-10.745-24-24-24H24c-13.255 0-24 10.745-24 24zm386.667-56H488c13.255 0 24-10.745 24-24v-80c0-13.255-10.745-24-24-24H386.667c-13.255 0-24 10.745-24 24v80c0 13.255 10.745 24 24 24zm0 160H488c13.255 0 24-10.745 24-24v-80c0-13.255-10.745-24-24-24H386.667c-13.255 0-24 10.745-24 24v80c0 13.255 10.745 24 24 24zM181.333 376v80c0 13.255 10.745 24 24 24h101.333c13.255 0 24-10.745 24-24v-80c0-13.255-10.745-24-24-24H205.333c-13.255 0-24 10.745-24 24z"></path></svg>Эмоджи скопирован!')
        .catch(() => console.log('error'));                              
}

function tutorialBtn() {
    tutorial.classList.toggle('active');
}

function statsBtn() {
    stats.classList.toggle('active');
}

function langsBtn() {
    langs.classList.toggle('active');
}

function generatorBtnFunc() {
    generator.classList.toggle('active');
    document.removeEventListener('keydown', pressKeys);
}

function generatorBtnOffFunc() {
    generator.classList.toggle('active');
    document.addEventListener('keydown', pressKeys);
}

function generatorFunc() {
	if (wordsAll.includes(generatorInput.value.toUpperCase())) {
		word = generatorInput.value.toUpperCase();
		guessChallengeFunc();
		generatorValid.style.display = "block";
		setTimeout(function() {
	        generatorValid.style.display = "none";
	    }, 1000); 
	}
	else {
		generatorNoValid.style.display = "block";
		setTimeout(function() {
	        generatorNoValid.style.display = "none";
	    }, 1000); 
	}
}
 
function getRandomInt(min, max) {
    min = Math.ceil(min);
    max = Math.floor(max);
    return Math.floor(Math.random() * (max - min)) + min; //Максимум не включается, минимум включается
}

function copyToClipboard(textToCopy) {
    // navigator clipboard api needs a secure context (https)
    if (navigator.clipboard && window.isSecureContext) {
        // navigator clipboard api method'
        return navigator.clipboard.writeText(textToCopy);
    } else {
        // text area method
        let textArea = document.createElement("textarea");
        textArea.value = textToCopy;
        // make the textarea out of viewport
        textArea.style.position = "fixed";
        textArea.style.left = "-999999px";
        textArea.style.top = "-999999px";
        document.body.appendChild(textArea);
        textArea.focus();
        textArea.select();
        return new Promise((res, rej) => {
            // here the magic happens
            document.execCommand('copy') ? res() : rej();
            textArea.remove();
        });
    }
}

function enc(str,key) {
    var length = key.length;
    var keyList = key.split("");
    var s="",bit,bit1,bit2,bit3,bit4;
    for(var i = 0;i<str.length;i++){
                     bit = str.charCodeAt (i); // Получить кодировку Unicode символа (числа)
        bit1=bit%length; 
        bit=(bit-bit1)/length;
        bit2=bit%length;
        bit=(bit-bit2)/length;
        bit3=bit%length;
        bit=(bit-bit3)/length;
        bit4=bit%length;
                     // расположение ключа bit1, bit2, bit3, bit4
                     // keyList [bit4] + keyList [bit3] + keyList [bit2] + keyList [bit1] Каждый символ в строке соответствует четырем символам секретного ключа
        s+=keyList[bit4]+keyList[bit3]+keyList[bit2]+keyList[bit1];
    }
    return s;
}
function dec(str,key) {
    var length = key.length;
    var bit,bit1,bit2,bit3,bit4,j=0,s;
    var s = new Array(Math.floor(str.length/4));
    var result =[];
    bit = s.length;
    for(var i=0;i<bit;i++){
        bit1 = key.indexOf(str.charAt(j));
        j++;
        bit2 = key.indexOf(str.charAt(j));
        j++;
        bit3 = key.indexOf(str.charAt(j));
        j++;
        bit4 = key.indexOf(str.charAt(j));
        j++;
        // бит1, бит2, бит3, бит4 Положение каждых четырех ключевых символов соответствует одному символу строки         
        s[i]=bit1*length*length*length+bit2*length*length+bit3*length+bit4;
                     // бит1 * длина * длина * длина + бит2 * длина * длина + бит3 * длина + бит4 восстанавливают кодировку Unicode для каждого символа строки
                     result.push (String.fromCharCode (s [i])); // Восстановить данные из кодировки Unicode
    }
     // Восстановить символы
    return result.join("");
}

ShareStats = {
    vkontakte: function(purl, ptitle, pimg, text) {
        url  = 'https://vk.com/share.php?';
        url += 'url='          + encodeURIComponent(purl);
        url += '&title='       + encodeURIComponent(ptitle);
        url += '&comment='  + `Моя%20Статистика%3A%20${gamesPlayed}%20Всего%20игр%2C%20${gamesWin}%20Выиграно%20игр%2C%20${percentWin}%25%20побед%2C%20${maxStreak}%20Лучшая%20Серия`;
        url += '&image='       + encodeURIComponent(pimg);
        ShareStats.popup(url);
    },
    facebook: function(purl, ptitle, pimg, text) {
        url  = 'http://www.facebook.com/sharer.php?s=100';
        url += '&p[title]='     + encodeURIComponent(ptitle);
        url += '&p[summary]='   + `Моя%20Статистика%3A%20%0A${gamesPlayed}%20Всего%20игр%2C%20%0A${gamesWin}%20Выиграно%20игр%2C%20%0A${percentWin}%25%20побед%2C%20%0A${maxStreak}%20Лучшая%20Серия`;
        url += '&p[url]='       + encodeURIComponent(purl);
        url += '&p[images][0]=' + encodeURIComponent(pimg);
        ShareStats.popup(url);
    },
    twitter: function(purl, ptitle) {
        url  = 'http://twitter.com/share?';
        url += 'text='      + `Моя%20Статистика%3A%20%0A${gamesPlayed}%20Всего%20игр%2C%20%0A${gamesWin}%20Выиграно%20игр%2C%20%0A${percentWin}%25%20побед%2C%20%0A${maxStreak}%20Лучшая%20Серия`;
        url += '&url='      + '%20%0A'   + encodeURIComponent(purl);
        url += '&counturl=' + encodeURIComponent(purl);
        ShareStats.popup(url);
    },
    whatsapp: function(purl, ptitle) {
        url  = 'https://api.whatsapp.com/send?';
        url += 'text='      + `Моя%20Статистика%3A%20%0A${gamesPlayed}%20Всего%20игр%2C%20%0A${gamesWin}%20Выиграно%20игр%2C%20%0A${percentWin}%25%20побед%2C%20%0A${maxStreak}%20Лучшая%20Серия`;
        url += '&url='      + '%20%0A'   + encodeURIComponent(purl);
        url += '&counturl=' + encodeURIComponent(purl);
        ShareStats.popup(url);
    },
    
            me : function(el){
                console.log(el.href);                
                ShareStats.popup(el.href);
                return false;                
            },

    popup: function(url) {
        window.open(url,'','toolbar=0,status=0,width=626,height=436');
        let xhr = new XMLHttpRequest();
        xhr.open('GET', 'counter.php');
        xhr.send();
    }
};

ShareWin = {
    vkontakte: function(purl, ptitle, pimg, text) {
        url  = 'http://vkontakte.ru/share.php?';
        url += 'url='          + encodeURIComponent(purl);
        url += '&title='       + encodeURIComponent(ptitle);
        url += '&comment='     + `Я угадал это русское слово из 5 букв с ${(cellsMax/5)-1}/6 попыток. Попытки:` + colorBlocksEnterResultVk;
        url += '&image='       + encodeURIComponent(pimg);
        url += '&noparse=true';
        ShareWin.popup(url);
    },
    facebook: function(purl, ptitle, pimg, text) {
        url  = 'http://www.facebook.com/sharer.php?s=100';
        url += '&p[title]='     + encodeURIComponent(ptitle);
        url += '&p[summary]='   + `Я угадал это русское слово из 5 букв с ${(cellsMax/5)-1}/6 попыток.` + colorBlocksEnterResultText;
        url += '&p[url]='       + encodeURIComponent(purl);
        url += '&p[images][0]=' + encodeURIComponent(pimg);
        ShareWin.popup(url);
    },
    twitter: function(purl, ptitle) {
        url  = 'http://twitter.com/share?';
        url += 'text='      + `Я угадал это русское слово из 5 букв с ${(cellsMax/5)-1}/6 попыток.` + colorBlocksEnterResultText;
        url += '&url='      + '%20%0A'   + encodeURIComponent(purl);
        url += '&counturl=' + encodeURIComponent(purl);
        ShareWin.popup(url);
    },
    whatsapp: function(purl, ptitle) {
        url  = 'https://api.whatsapp.com/send?';
        url += 'text='      + `Я угадал это русское слово из 5 букв с ${(cellsMax/5)-1}/6 попыток.` + colorBlocksEnterResultText;
        url += '&url='      + '%20%0A'   + encodeURIComponent(purl);
        url += '&counturl=' + encodeURIComponent(purl);
        ShareWin.popup(url);
    },
    
            me : function(el){
                console.log(el.href);                
                ShareWin.popup(el.href);
                return false;                
            },

    popup: function(url) {
        window.open(url,'','toolbar=0,status=0,width=626,height=436');
        let xhr = new XMLHttpRequest();
        xhr.open('GET', 'counter.php');
        xhr.send();
    }
};

Share = {
    vkontakte: function(purl, ptitle, pimg, text) {
        url  = 'http://vkontakte.ru/share.php?';
        url += 'url='          + encodeURIComponent(purl);
        url += '&title='       + encodeURIComponent(ptitle);
        url += '&comment='     + 'Corgli - Играйте в Wordle с неограниченным количеством слов';
        url += '&image='       + encodeURIComponent(pimg);
        url += '&noparse=true';
        Share.popup(url);
    }, 
    facebook: function(purl, ptitle, pimg, text) {
        url  = 'http://www.facebook.com/sharer.php?s=100';
        url += '&p[title]='     + encodeURIComponent(ptitle);
        url += '&p[summary]='   + 'Corgli - Играйте в Wordle с неограниченным количеством слов';
        url += '&p[url]='       + encodeURIComponent(purl);
        url += '&p[images][0]=' + encodeURIComponent(pimg);
        Share.popup(url);
    },
    twitter: function(purl, ptitle) {
        url  = 'http://twitter.com/share?';
        url += 'text='      + 'Corgli - Играйте в Wordle с неограниченным количеством слов';
        url += '&url='      + '%20%0A'   + encodeURIComponent(purl);
        url += '&counturl=' + encodeURIComponent(purl);
        Share.popup(url);
    },
    whatsapp: function(purl, ptitle) {
        url  = 'https://api.whatsapp.com/send?';
        url += 'text='      + 'Corgli - Играйте в Wordle с неограниченным количеством слов';
        url += '&url='      + '%20%0A'   + encodeURIComponent(purl);
        url += '&counturl=' + encodeURIComponent(purl);
        Share.popup(url);
    },
    
            me : function(el){
                console.log(el.href);                
                Share.popup(el.href);
                return false;                
            },

    popup: function(url) {
        window.open(url,'','toolbar=0,status=0,width=626,height=436');
        let xhr = new XMLHttpRequest();
        xhr.open('GET', 'counter.php');
        xhr.send();
    }
};

function pressKeys(event) {
    if (event.keyCode == 81) {
        enterKey('Й');
    }
    if (event.keyCode == 87) {
        enterKey('Ц');
    }
    if (event.keyCode == 69) {
        enterKey('У');
    }
    if (event.keyCode == 82) {
        enterKey('К');
    }
    if (event.keyCode == 84) {
        enterKey('Е');
    }
    if (event.keyCode == 89) {
        enterKey('Н');
    }
    if (event.keyCode == 85) {
        enterKey('Г');
    }
    if (event.keyCode == 73) {
        enterKey('Ш');
    }
    if (event.keyCode == 79) {
        enterKey('Щ');
    }
    if (event.keyCode == 80) {
        enterKey('З');
    }
    if (event.keyCode == 219) {
        enterKey('Х');
    }
    if (event.keyCode == 221) {
        enterKey('Ъ');
    }

    if (event.keyCode == 65) {
        enterKey('Ф');
    }
    if (event.keyCode == 83) {
        enterKey('Ы');
    }
    if (event.keyCode == 68) {
        enterKey('В');
    }
    if (event.keyCode == 70) {
        enterKey('А');
    }
    if (event.keyCode == 71) {
        enterKey('П');
    }
    if (event.keyCode == 72) {
        enterKey('Р');    }
    if (event.keyCode == 74) {
        enterKey('О');
    }
    if (event.keyCode == 75) {
        enterKey('Л');
    }
    if (event.keyCode == 76) {
        enterKey('Д');
    }
    if (event.keyCode == 186) {
        enterKey('Ж');
    }
    if (event.keyCode == 222) {
        enterKey('Э');
    }

    if (event.keyCode == 90) {
        enterKey('Я');
    }
    if (event.keyCode == 88) {
        enterKey('Ч');
    }
    if (event.keyCode == 67) {
        enterKey('С');
    }
    if (event.keyCode == 86) {
        enterKey('М');
    }
    if (event.keyCode == 66) {
        enterKey('И');
    }
    if (event.keyCode == 78) {
        enterKey('Т');
    }
    if (event.keyCode == 77) {
        enterKey('Ь');
    }
    if (event.keyCode == 188) {
        enterKey('Б');
    }
    if (event.keyCode == 190) {
        enterKey('Ю');
    }

    if (event.keyCode == 8) {
        if (cellsCount > cellsMax - 5) {   
            cells[cellsCount-1].text = '';
            cellsCount--;
            colorKeys.pop();
            letterKeys.pop();
        }
    }
    if (event.keyCode == 13) {
        enterCheck();
    }
}